[
    {
    "id": "act_ring",
    "name": "STEP INTO THE RING",
    "activation": "Downtime",
    "terse": "Take part in a contest of skill.",
    "detail": "When you Step Into the Ring, you take part in some sort of formal, structured competition that's particular to wherever you happen to be, such as mech racing, Karrakin saber dueling, gladiatorial fights, high-stakes gambling, or virtual gaming. This is more than just a casual pick-up game, but instead a serious contest of skill and determination. Applicable triggers depend on what sort of competition it is; gladiatorial bouts, martial arts, and combat sports could involve Apply Fists to Faces or Assault, a race might involve Get Somewhere Fast or Stay Cool, gambling might rely on Charm or Read a Situation, and so on.<br><br>Name what it is you plan to compete in. You start out with +0 in Fame, which represents your renown both in and out of the ring. Your Fame might increase as a result of your performance, up to a maximum of +6, and it can be used as a bonus to skill checks that involve leveraging your reputation, interacting with fans, and otherwise exploiting the benefits of celebrity. Making a name for yourself can be a double-edged sword, though, and the more famous you become the more others might seek to exploit you in turn. You can't choose not to gain Fame either, it happens whether you want it or not. If you don't want to risk gaining a rep, you shouldn't be stepping into the ring.<br><br>When it's time to compete, roll:<br><br>On 9 or less, you suffer a brutal defeat. Learn a painful lesson, lose 2 Fame to a minimum of 0, then choose one of the following:<ul><li>Your defeat is particularly humiliating, and people will remember it.</li><li>You suffer an injury, acquire a debt, or make an enemy.</li></ul>On a 10-19, choose whether you won or lost. If you won, it was hard fought but you came out ahead in the end. If you lost, you still put in a good showing. Then choose one of the following:<ul><li>You gain +2 Fame. If you won, you also gain a rival. If you lost, you gain someone's admiration or respect.</li><li>Your performance attracts someone's attention. Gain something as Reserves on your next mission, it could be a useful item or information, but you'll owe your benefactor a favor.</li></ul>On a 20+, you win a decisive victory. Gain +2 Fame, and choose one of the following:<ul><li>You gain something as Reserves on your next mission. Perhaps it was awarded as a prize, won as part of a gambling pot, or gifted by a sponsor.</li><li>Your performance opens a door for you that was previously closed. This could be an invitation to an exclusive club, an underground organization, or a secret society.</li><li>Your victory was particularly remarkable, and people will remember it.</li></ul>"
  }
]