[
    {
        "id": "cb_all_environment_adaptation",
        "name": "All-Environment Adaptation",
        "source": "C&H",
        "effect": "You gain +1 Accuracy on all checks and saves with one mech skill of your choice (Hull, Agility, Systems, or Engineering), and may choose a different skill whenever you perform a Full Repair. You gain Immunity to all damage, heat, and burn from hostile environmental sources including dangerous terrain, and you automatically pass all checks and saves imposed by hostile environmental sources.",
        "description": "A chassis retrofit utilizing C&H's thermoregulation polymer mesh along with overlapping layers of radiation shielding, electronic systems hardening, and non-conductive ceramic matrix alloys, providing outfitted mechs with robust hostile environmental protection across multiple biomes."
    },
    {
        "id": "cb_autoextinguishers",
        "name": "Autoextinguishers",
        "source": "C&H",
        "effect": "You gain Resistance to burn, and you and all adjacent allied characters automatically pass all checks to clear burn. ",
        "description": "In the event of high-speed crashes and other similar catastrophic impact events, the window for effective pilot recovery shortens drastically in the event of a cockpit fire. C&H's racing derived all-chassis template utilizes a dedicated chemical minifac to automatically produce a variety of fast-acting, stably inert flame suppressants and other neutralizing agents as circumstances dictate."
    },
	{
        "id": "cb_blowout_panels",
        "name": "Blowout Panels",
        "source": "C&H",
        "effect": "Whenever an attack causes you to take structure damage, you gain Resistance against all excess damage beyond what was required to reach 0 HP. Additionally, whenever you roll the System Trauma result on the structure damage table, you always choose the weapons or systems to destroy without rolling.",
        "description": "Through a comprehensive full-frame upgrade consisting of strategically engineered pre-weakened casings printed around potentially volatile systems such as internal munitions storage or power relays, catastrophic damage can be mitigated by channeling secondary detonations and pressure waves away from vital structural components in a controlled, predetermined fashion."
    },
    {
        "id": "cb_crash_bars",
        "name": "Crash Bars",
        "source": "C&H",
        "effect": "You may roll all structure damage checks twice and choose either result. Additionally, you gain Immunity to all damage from falling.",
        "description": "Enhanced physical protection and damage mitigation can be achieved through an integrated series of crash bars, appliqué armor overlays, and cockpit reinforcement. While such measures are often employed by racers or arena fighters to reduce collision trauma and extend active uptime, they also benefit combat pilots operating in high-threat conditions or during air-drop/orbital insertion maneuvers."
    },
    {
        "id": "cb_emergency_reactor_override",
        "name": "Emergency Reactor Override",
        "source": "C&H",
        "effect": "Whenever you make an overheating check, you use the following special Overheating Table instead of the normal one.<ul><li>5-6 - Power Rerouting: Your next ranged or melee attack deals +1d6 bonus damage on hit.</li><li>2-4 - Emergency Jump Jets: Your mech becomes Exposed, and you may immediately fly your speed, ignoring Slow and Immobilize from hostile sources. This movement ignores engagement and doesn't provoke reactions, but you must end this movement on the ground or another solid surface, or else immediately begin falling.</li><li>1 - Controlled Meltdown: The result depends on your mech's remaining Stress: 3+ Stress: Your mech becomes Exposed, and you may immediately fly as per Emergency Jump Jets. 2 Stress: Roll an Engineering check. On a success, your mech becomes Exposed and you may immediately fly as per Emergency Jump Jets; on a failure, clear all conditions which were not caused by your own systems or abilities, and then your mech suffers a reactor meltdown after 1d6 of your turns (rolled by the GM). A reactor meltdown can be prevented by retrying the Engineering check as a quick action. 1 Stress: Your mech suffers a reactor meltdown at the end of your next turn. Clear all conditions which were not caused by your own systems or abilities, you may immediately fly as per Emergency Jump Jets, and your next ranged or melee attack deals +1d6 bonus energy damage on hit.</li><li>Multiple 1's - Hyperspec Meltdown: Your mech suffers a reactor meltdown at the end of your next turn. Clear all conditions which were not caused by your own systems or abilities, you may immediately fly as per Emergency Jump Jets, and your next ranged or melee attack deals +1d6 bonus energy damage on hit.</li></ul>",
        "description": "Most military-grade coldcore reactors impose automatic safety cutoffs during forced venting procedures in order to avoid cascading stresses, but a series of custom reactor modifications allow operators to skillfully (if perhaps incautiously) override these cutoffs, permitting brief moments of hyperspec action by rerouting power feeds directly into a frame's primary systems along with a series of integrated emergency-use jump jets."
    },
    {
        "id": "cb_hypertuned_interface",
        "name": "Hypertuned Interface",
        "source": "C&H",
        "effect": "Whenever you become Stunned due to hostile effects or structure damage, you may still make a standard move and a quick action of your choice during your turn. Additionally, 1/scene, whenever you Overcharge to make an attack as an additional quick action, you may add +2 Accuracy to any attack roll that action requires and its damage cannot be reduced in any way.",
        "description": "An extremely risky modification often proscribed by formal military regulations but frequently employed by mercenaries, gladiators, and those desperate enough to need it, overclocking a mech's neural interface systems can give pilots a valuable edge when they need it most, albeit at a dangerous cost. Overuse of such modifications can result in ruptured blood vessels, partial or total limb paralysis, neurological damage, and even death."
    },
    {
        "id": "cb_enhanced_systems_upgrade",
        "name": "Enhanced Systems Upgrade",
        "source": "GMS",
        "effect": "You gain +2 SP. 1/round, on a successful Invade against a hostile character you may either deal +2 heat or choose a second Invasion option (you must choose two different options).",
        "description": "Establishing the baseline for quality in an ever-evolving galaxy means innovation and iteration. Smaller, lighter, faster, and more powerful electronic and systemic components allow that quality to be continuously maintained.",
        "bonuses": [{
            "id": "sp",
            "val": 2
        }]
    },
    {
        "id": "cb_kangto_endochassis",
        "name": "Kangto Endochassis",
        "source": "GMS",
        "effect": "You may Eject as a reaction whenever your mech is destroyed. Additionally, 1/mission you may replace the mech you are piloting with the GMS Kangto, even if your original mech was destroyed. You may either do this during a rest, or you may do it when you Eject, automatically Mounting this mech and flying 6 spaces in a direction of your choice. Doing this resets your Overcharge counter, destroys your original mech if it was not destroyed already, and your original mech can no longer be repaired or otherwise revived for the remainder of the mission; if your mech is undergoing a reactor meltdown (such as from damage or Self-Destruct) it continues to do so and is then destroyed. This mech shares all your mech skill bonuses, Grit, talents (including weapons and systems granted by talents), and core bonuses as normal. It has its own Core System, enters play with 1 Core Power, and you may allocate its own weapons and systems however you like independently of your original mech during Full Repairs.",
        "description": "Redundancies and layers. It's how GMS engineers everything from prefabricated habitat modules to capital-tier starships, and it's why their designs persist. What if you could take that concept one step further and build a chassis upon a foundation of something greater than a mere hardsuit? Redundancies and layers, and a second chance for those in need."
    },
    {
        "id": "cb_superior_logistics",
        "name": "Superior Logistics",
        "source": "GMS",
        "effect": "1/scene, you may perform one of the following options as a quick action:<ul><li>Repair one destroyed weapon or system belonging to you or an allied character within Range 3.</li><li>Lock On to or Bolster up to three characters within Sensors.</li><li>Create a Blast 1 area of \"smart cover\" within Range 5 that lasts until the end of the scene. Allied characters, including yourself, at least partly within this area gain soft cover. Hostile characters treat it as difficult terrain.</li><li>Call in an artillery strike targeting a Blast 2 area within Range 20. All characters within the area must pass an Agility save or take 2d6 damage. On a success, they take half damage. You choose this strike's damage type (kinetic, explosive, or energy) when you use it.</li></ul>",
        "description": "GMS is the galactic standard in more than just mech design. From weapons and ammunition to rear echelon support and logistics technologies, every battlefield element can be streamlined, enhanced, and placed directly at your fingertips."
    }
]