[
    {
        "id": "fgtswm_weapon_hardening",
        "name": "Weapon Hardening",
        "source": "C&H",
        "license": "MATADOR",
        "license_level": 2,
        "sp": 2,
        "description": "By taking standard armaments and retrofitting them with reinforced power supplies, redundant ammunition feeds, ablative firewalls, and backup dummy targeting systems, pilots can avoid forced interruption of offensive capabilities during high-threat combat scenarios. Such modifications are highly discouraged by many manufacturers as they often require disabling key interface components and handshake firmware in order to properly insulate the weapon from systemic attacks and electromagnetic disruption, but many pilots find the additional uptime to be worth any number of voided end-use agreements.",
        "effect": "Choose one weapon. While you are Jammed you may still attack with this weapon, but it receives +1 Difficulty on all attacks while Jammed. 1/mission, whenever this weapon would be destroyed you may ignore that effect."
    },
    {
        "id": "fgtswm_scrambler_rounds",
        "name": "Scrambler Rounds",
        "source": "C&H",
        "license": "RETIARIUS",
        "license_level": 2,
        "sp": 2,
        "description": "Typically electronic warfare operates on a principle of wide-area efficacy, but subsonic, zero-penetration electrostatic jammer ammunition provides a more surgical application where necessary. Designed to be fired from a variety of chassis-scale armaments, the adhesive gel-encased projectiles do minimal damage in and of themselves, but the powerful wideband signal scramblers embedded within each one are capable of overwhelming a mech's sensors and targeting systems, rendering them effectively blind for their duration.",
        "effect": "Choose one CQB, Cannon, or Rifle: when you attack with it, you may fire a scrambler round instead of attacking normally. On hit, you deal half damage, heat, and burn, but the target treats all characters further than Range 10 as if they were Invisible and all other characters as if they were in soft cover until the end of their next turn.",
        "tags": [
            {"id": "tg_unique"}
        ],
        "allowed_types": ["Cannon","CQB","Rifle"]
    },
    {
        "id": "fgtswm_auto_adjusting_weight",
        "name": "Auto-Adjusting Weight",
        "source": "C&H",
        "license": "SABREUR",
        "license_level": 1,
        "sp": 2,
        "description": "In the field of weapons engineering, balance is just as important for mech-tier weaponry as it is for a noble's personal dueling blade. Most mech weapons are designed to adequately suit the chassis that wields them, but by incorporating a series of motorized auto-adjusting weights into a weapon's structure, its balance can be dynamically realigned with every strike. While this does little to improve the weapon's overall lethality directly, it greatly enhances its responsiveness even during complex offensive maneuvers, allowing for enhanced precision and control, and consequently a higher probability of scoring effective kills.",
        "effect": "Choose one melee weapon. It gains Reliable based on weapon size (Auxiliary: 1, Main: 2, Heavy or larger: 3), or if it already has Reliable it adds +1 to its value. 1/round when you attack with this weapon, you may add either +1 to its Threat or +3 to its Thrown range.",
        "allowed_types": ["Melee"]
    },
    {
        "id": "fgtswm_underbarrel_breacher",
        "name": "Underbarrel Breacher",
        "source": "IPS-N",
        "license": "POINTMAN",
        "license_level": 1,
        "sp": 3,
        "description": "IPS-Northstar's venerable \"Passkey\" compact tactical breaching system is a mainstay of squads tasked with high risk breach-and-clear missions. A universal mounting assembly allows the Passkey to be fitted to most manufacturers' mainline weapon models, and convenient fire-control integration means that operators can effortlessly switch between the launcher and the weapon it's mounted to. Utilizing dual-stage APEX charges which bore into target surfaces before detonating within, this system is ideal for rapid entry, breaching reinforced structures, or creating improvised firing positions.",
        "effect": "Choose one Main or Heavy weapon. You may use the following profile whenever you attack with that weapon. Any other modifications (from core bonuses etc) applied to the weapon do not apply to this profile, and you may continue to attack with the modified weapon even when this profile requires reloading.",
		"integrated": ["fgtsmw_underbarrel_launcher_weapon"],
        "tags": [
            {"id": "tg_unique"}
        ],
        "allowed_sizes": ["Main", "Heavy"]
    },
    {
        "id": "fgtswm_optimized_engineering",
        "name": "Optimized Engineering",
        "source": "HA",
        "license": "FOUNDRY",
        "license_level": 1,
        "sp": 2,
        "description": "The overall quality of equipment is the culmination of numerous factors, from initial design to expected stresses and material engineering, all the way to economic concerns. The Armory's engineers, though, are well aware that many such such deficiencies can be overcome through the simple, if extravagant, application of exacting, high-tolerance engineering without regard for material cost. For those willing to shoulder that cost, HA offers a universally compatible general purpose upgrade permission package, designated BENCHMARK, allowing any printer-licensed weapon's construction to be revised to meet Armory standards.",
        "effect": "Choose one ranged weapon. You may spend a charge to either reroll any one attack roll made with this weapon 1/round, though you must take the second result, or to repair this weapon for no cost during a rest.",
        "tags": [
            {"id": "tg_limited", "val": 2},
            {"id": "tg_unique"}
        ],
        "restricted_types": ["Melee"]
    }
]