[
  {
  "id": "fgts_exo_araska",
    "name": "ARASKA-Class NHP",
    "type": "AI",
    "sp": 3,
    "tags": [{
        "id": "tg_ai"
      },
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_exotic"
      }
    ],
    "source": "EXOTIC",
    "effect": "Your mech gains the AI tag and another Core System, Rain of Vengeance. When an attack roll against you lands on 19-20, the attacker is pulled 2 spaces in a direction of your choice and gains Lock On.",
    "actions": [{
      "name": "Rain of Vengeance",
      "activation": "Full",
      "detail": "Spend 1 CP and create a Blast 4 zone anywhere within Range 20. This does not require line of sight. At the beginning of the next character's turn you gain an Impact Die, 1d6 starting at 6, and then you may move the zone 2 spaces in any direction. On each subsequent turn reduce the value of the Impact Die by 1, then you may move the zone another 2 spaces in any direction. When the Impact Die reaches 1, all characters within the zone are immediately knocked Prone and must pass a Hull save or take 8d6 AP kinetic damage. On a success, they take half damage. Objects and terrain in the area are automatically dealt 100 AP kinetic damage. After this ability resolves, make a Systems check. On a failure, ARASKA enters cascade.<br>This Core System may only be used on Suldan while the planetary defense network remains active, and the bombardment can easily penetrate objects and terrain, allowing it to be used in areas such as subterranean caverns or within buildings. Attempting to use it elsewhere has no effect without first establishing an uplink with other local planetary defense systems or their equivalent."
    }],
    "description": "A black box partition of the NHP controlling the Suldani planetary defense network, this haughty and willful iteration of ARASKA has been separated from the prime unit and is no longer beholden to the Emir's genetic security protocols. While this divergence means they lack uncontested access to the systems that were once their domain, with sufficient effort they can still briefly assert control long enough to bring certain instruments to bear. Though the satellite network's heavier kinetic ordnance resides behind more stringent security barriers, flechette packets rated for low-level precision fire-support/bombardment operations are relatively easier to access."
    },
   {
   "id": "fgts_exo_fragment_araska",
     "name": "Fragment of ARASKA",
     "type": "Tech",
     "sp": 2,
      "tags": [
        {
          "id": "tg_unique"
        },
        {
          "id": "tg_exotic"
        }
      ],
      "source": "EXOTIC",
      "effect": "1/scene, you may take one of the following Quick Tech actions:",
      "actions": [
        {
          "name": "Vision of Fire",
          "activation": "Quick Tech",
          "detail": "A hostile character within Sensors takes 1d6+6 heat. You take half of the heat inflicted, before reduction. You may then repeat this once more against the same character or a different hostile character within Sensors. If this action causes you to exceed your Heat Cap, you gain +1 Accuracy to all attacks, checks, and saves until the end of your next turn."
        },
        {
          "name": "Lambent Shroud",
          "activation": "Quick Tech",
          "detail": "Choose a hostile character within Sensors. Until the end of your next turn, that character and all hostile characters adjacent to them take half of all damage, heat, and burn dealt to you by hostile sources, before calculating Armor and Resistance, and any hostile conditions you take are also taken by those characters."
        }
      ],
      "description": "Recovered following the destruction of the cascading ARASKA metaform, while this artifact outwardly resembles a chunk of sand-fused obsidian, it displays a number of anomalous physical and metaphysical properties similar to those noted in other such recovered objects. The artifact constantly radiates heat, maintaining an elevated temperature through unknown means which unpredictably fluctuates, periodically growing hot enough to inflict second-degree burns on unshielded handlers before returning to nominal levels, and it has thus far proven impervious to any and all attempts at taking material samples for further analysis. As with similar examples catalogued elsewhere, despite the presence of compressed data embedded within the object's structure observable through deep resonance imaging, no evidence of sentience or self-directed action can be observed."
    },
    {
    "id":"fgtsms_bomblet_dispenser",
    "name": "Bomblet Dispenser",
    "type": "System",
    "sp": 2,
    "tags": [
      {"id": "tg_unique"},
      {"id": "tg_round", "val": 1}
    ],
    "source" : "C&H",
    "license": "CHARIOTEER",
    "license_level": 1,
    "effect": "1/round, you may use this system as part of a Boost to create an area up to 5 adjacent spaces you moved through during that action (unused spaces are lost). Any hostile character that starts their turn in the area or enters it for the first time in a round must pass an Agility save or take 2 explosive damage and become Slowed until the end of their next turn. Characters who enter the area during their turn and fail this save also stop moving immediately and lose any unused movement as if they had become Engaged. This area lasts until the end of the scene or until you use this system to create a new area, and then deactivates.",
    "synergies":[{
      "locations": ["boost"],
      "detail": "1/round, you may use this system as part of a Boost to create an area up to 5 adjacent spaces you moved through during that action (unused spaces are lost). Any hostile character that starts their turn in the area or enters it for the first time in a round must pass an Agility save or take 2 explosive damage and become Slowed until the end of their next turn. Characters who enter the area during their turn and fail this save also stop moving immediately and lose any unused movement as if they had become Engaged. This area lasts until the end of the scene or until you use this system to create a new area, and then deactivates."
    }],
    "description": "On the combat racing circuits, the most effective armaments are those that don't require you to stop moving. Often mounted to a frame's legs or built into a portion of the rear hull, so-called \"party popper\" dispensers scatter the ground behind a moving mech with dozens of dual-trigger explosive bomblets, detonated either by pressure or when proximity sensors send them bounding into the air to detonate a moment later, inflicting mobility kills on pursuers by targeting motive systems and leg joints. Some pilots, less interested in racing, have discovered that this can be used just as effectively as an area denial and anti-pursuit system."
  },
  {
    "id":"fgtsms_glide_rollers",
    "name": "Glide Rollers",
    "type": "System",
    "sp": 2,
    "tags": [
      {"id": "tg_unique"},
      {"id": "tg_round", "val": 1}
    ],
    "source" : "C&H",
    "license": "CHARIOTEER",
    "license_level": 2,
    "effect": "1/round, when you Boost you can take Heat equal to your mech's Size+1 to move up to twice your Speed. During this movement you can't fly or teleport, and you treat difficult terrain as dangerous terrain that deals kinetic damage instead.",
    "synergies":[{
      "locations": ["boost"],
      "detail": "1/round, when you Boost you can take Heat equal to your mech's Size+1 to move up to twice your speed. During this movement you can't fly or teleport, and you treat difficult terrain as dangerous terrain that deals kinetic damage instead."
    }],
    "description": "Without this particular upgrade, non-flight chassis racing as a sport might very well not exist. A secondary movement system consisting of a series of high performance omnidirectional smart-wheels is incorporated into a chassis' feet, lower leg assemblies, and even brachial structures, coupled with ground-scanning terrain sensors and a robust upgrade to the core computer's automatic balance control systems. Skilled pilots are able to utilize this to achieve incredible ground speeds, but what works on the racetrack may not be rated for use on less even terrain."
  },
  {
    "id": "fgtsms_deployable_reconnaissance_carbine",
    "name": "Deployable Reconnaissance Carbine",
    "type": "System",
    "sp": 2,
    "tags": [
      {"id": "tg_unique"}
    ],
    "source" : "C&H",
    "license": "CHARIOTEER",
    "license_level": 2,
    "effect": "This system functions as a weapon with the following profile which can be used to attack with, including Skirmish and Barrage. [Main CQB, Unique, Range 8, 1d6 + 1 kinetic damage] It does not require a mount, and it cannot be modified or benefit from core bonuses.",
    "description": "Cheaply printed disposable weapon systems have long been a quick and efficient way to equip colonial militias until more robust supply lines can be established, or for thrifty arena managers to outfit their dregs so that they can at least provide some small measure of challenge before they're unceremoniously dispatched. In need of offensive designs to flesh out their Charioteer license, C&H has opted to rebrand this concept, billing it as a lightweight and space-efficient carbine for recon units. Engineered from higher quality materials than its shoddier counterparts, the weapon's collapsible-body design makes it easy for even lightweight chassis to store, while the self-contained integrated caseless ammunition feed minimizes recoil."
  },
  {
    "id": "fgtsms_variable_geometry_hull",
    "name": "Variable Geometry Hull",
    "type": "System",
    "sp": 3,
    "tags": [
      {"id": "tg_unique"}
    ],
    "source" : "C&H",
    "license": "CHARIOTEER",
    "license_level": 3,
    "effect": "You streamline your chassis, choosing from one of the following effects that last until the end of the scene, or you use this action again: <ul><li>You may move an additional 2 spaces when you Boost, but you make all Hull and Agility checks and saves with +1 Difficulty.</li><li>You gain +2 Accuracy on all Hull and Agility checks and saves, but become Slowed.</li><li>Return to normal, losing all benefits and drawbacks of this system.</li></ul>",
    "actions":[{
      "name": "Streamline Chassis",
      "activation": "Protocol",
      "detail": "You streamline your chassis, choosing from one of the following effects that last until the end of the scene, or until you use this system again: <ul><li>You may move an additional 2 spaces when you Boost, but you make all Hull and Agility checks and saves with +1 Difficulty.</li><li>You gain +2 Accuracy on all Hull and Agility checks and saves, but become Slowed.</li><li>Return your chassis to normal, losing all benefits and drawbacks of this system.</li></ul>"
    }],
    "description": "A substantial engineering endeavor, this upgrade completely overhauls a frame's external structure through the addition of a complex array of airbrakes, control surfaces, piezoelectric actuators, and servo-articulated armor, all tied into a sophisticated expert system which allows for a pilot to adjust the geometry of their frame's hull on the fly, switching between configurations optimized for speed or for maneuverability/stability as changing battlefield circumstances dictate. While a certain increase in hangar maintenance downtime is unavoidable due to the complex nature of this upgrade, speed enthusiasts and reconnaissance operators alike swear by it."
  },
    {
      "id": "fgtsms_courser_class_cc",
      "name": "COURSER-Class C/C",
      "type": "AI",
      "sp": 3,
      "tags": [
        {"id": "tg_ai"},
        {"id": "tg_unique"},
        {"id": "tg_limited","val": 1}
      ],
      "source" : "C&H",
      "license": "CHARIOTEER",
      "license_level": 3,
      "effect": "Your mech gains the AI tag and Flocking Dynamics. Whenever you Bolster an allied character, you and your target may both move 1 space in any direction. Whenever you Scan a hostile character, you may move 1 space and pull your target 1 space in any direction.<br><br>This system is not a true NHP and cannot enter cascade. Whenever it would enter cascade, instead you are immediately pulled 3 spaces in a direction of the GM's choice.",
      "actions":[{
        "name": "Flocking Dynamics",
        "activation": "Full",
        "frequency":"1/scene",
        "detail": "You and all allied characters within Sensors may immediately move up to their speed. This movement ignores engagement and does not provoke reactions."
      }],
      "synergies":[
        {
          "locations": ["tech"],
          "detail": "Whenever you take the Bolster action, you and your target may both move 1 space, and whenever you take the Scan action you may move 1 space and move your target 1 space in any direction."
        }
      ],
      "description": "Following the initial rollout of the Charioteer, plans were made to expand the frame's role beyond reconnaissance to create a mobile command-and-control platform, but the initial proposal for developing a partnered NHP fell through due to limited resources. Instead, C&H engineers settled upon a new design, employing an automated traffic control and management companion/concierge unit as the foundation for a new military grade system. The resultant comp/con, designated COURSER, is comprised of a central processing intelligence assisted by multiple subordinate expert analytical systems to direct and enhance small-unit coordination during high-speed maneuvers across numerous theaters and terrain types. Early field tests of COURSER-equipped frames have thus far proven extremely promising, though the system does occasionally experience difficulty adapting to novel battlefield experiences, but C&H has committed to a multi-year roadmap of planned updates to continue refining and enhancing its performance based on collated user data."
  },
  {
    "id": "fgtsms_era_layering",
    "name": "ERA Layering",
    "type": "System",
    "sp": 2,
    "tags": [
      {"id": "tg_unique"}
    ],
    "source" : "C&H",
    "license": "KALISTA",
    "license_level": 1,
    "effect": "Whenever you are hit by a melee attack, the attacker takes 2 explosive damage. While grappling, as a full action you may deal 6 explosive damage to a character in the grapple, but you become Impaired until the end of your next turn.",
    "actions":[{
      "name": "Explosive Grapple",
      "activation": "Full",
      "detail": "You may choose one target grappling or grappled by you and deal 6 explosive damage to them, but you become Impaired until the end of your next turn."
    }],
    "description": "Explosive reactive armor is considered somewhat deprecated compared to modern counter-harmonic/electromagnetic active defense systems, but even outdated technologies can find a new life in the right context. An externally mounted network of explosive modules affixed over the hull and linked to an expert system, the original purpose of this upgrade was to deflect and diffuse incoming enemy fire with impact-triggered detonations, but many pilots find it much more useful as an explosive close-quarters enhancement."
  },
  {
    "id": "fgtsms_repair_paste_capillaries",
    "name": "Repair Paste Capillaries",
    "type": "System",
    "sp": 3,
    "tags": [
        {"id": "tg_overshield"},
        {"id": "tg_unique"},
        {"id": "tg_limited","val": 2}
    ],
    "source" : "C&H",
    "license": "KALISTA",
    "license_level": 2,
    "actions":[{
      "name": "Battle Scars",
      "activation": "Reaction",
      "frequency": "1/round",
      "trigger": "You take 5 or more kinetic, energy or explosive damage from a single attack (after Armor and Resistance).",
      "detail": "You gain Overshield equal to Grit +4, and you gain +2 Accuracy to the next skill check or save you make until the end of your next turn."
    }],
    "description": "The semi-active nanite slurry commonly known as repair paste isn't a substitute for actual repairs, automated or otherwise, but in sufficient quantities it can nonetheless spell the difference between survival and destruction. Some arena fighters learned to modify their mechs with reservoirs of the substance rigged to flood damaged areas, holding malfunctioning systems together and patching compromised hulls. This licensed system improves on that original modification, incorporating a dedicated capillary system tied into the core's damage control subroutines enabling them to shunt measured quantities of repair paste to critical areas as needed."
  },
  {
    "id": "fgtsms_ogoun_class_nhp",
    "name": "OGOUN-Class NHP",
    "type": "AI",
    "sp": 3,
    "tags": [
      {"id": "tg_ai"},
        {"id": "tg_unique"},
        {"id": "tg_heat_self", "val": 3}
    ],
    "source" : "C&H",
    "license": "KALISTA",
    "license_level": 3,
    "effect": "Your mech gains the AI tag and Lord of Iron.",
    "actions":[{
      "name": "Lord of Iron",
      "activation": "Reaction",
      "frequency": "1/round",
      "trigger": "You are hit by an attack or fail a save which causes you to become Immobilized, Jammed, or Stunned.",
      "tags":[
        {"id": "tg_heat_self","val": 3}
      ],
      "detail": "You gain Resistance to all damage (including the triggering attack or save) and cannot fail Hull or Agility saves or checks until the end of your next turn. This effect resolves after any damage dealt by the triggering attack or save, but before the condition is applied."
    }],
    "description": "The current premier offering from C&H's in-development NHP coaching and curation program, OGOUN was catalyzed from neural engrams of over 500 arena combatants selected during an intensive and clandestine two year trial, not just for combat prowess but for resilience, tenacity, and adaptability under pressure. As a result OGOUN is surprisingly multifaceted for a fledgling NHP, incorporating hypercognizant threat-adaptation subroutines and advanced self-diagnostic heuristics into its core matrix. Personality-wise, OGOUN clones tend to be less formal than NHPs designed primarily by and for military interests, but pilots should be aware that they possess a prideful streak and those who fail to live up to their standards may find themselves regularly berated until their combat performance metrics noticeably improve."
  },
  {
    "id": "fgtsms_spider_charges",
    "name": "Spider Charges",
    "source" : "C&H",
    "sp": 2,
    "tags": [
      {"id": "tg_limited", "val": 2},
      {"id": "tg_unique"},
      {"id": "tg_grenade"}
    ],
    "license": "KALLARANI",
    "license_level": 2,
    "type": "Deployable",
    "actions":[{
      "name": "Sentry Grenade",
      "activation": "Quick",
        "range": [
          {
            "type": "Range",
            "val": 5
          }
        ],
      "detail": "Throw a Sentry Grenade within Range 5 that automatically attaches to characters and objects, arming itself. When a hostile character other than the stuck target moves within Range 2 or starts their turn within Range 2 of an attached grenade, it detonates and fires a guided projectile at them. That character must pass a Systems save or take 1d6+3 explosive damage and be knocked Prone. On a success, they take half damage only. Characters can only trigger a single sentry grenade this way per turn, they can detach sentry grenades from themselves by passing a Systems save as a quick action on their turn, and undetonated grenades disarm at the end of the scene."
    }],
    "deployables": [{
      "name": "Spider Mine",
      "type": "Mine",
      "detail": "This mine detonates when a hostile character moves adjacent to or over it, or the mine's movement causes it to collide with a hostile character. Characters within a Burst 1 area must pass a Systems save or take 2d6 explosive damage. On a success, they take half damage.",
      "actions":[{
        "name": "Move Spider Mine",
        "activation": "Protocol",
        "detail": "Move an armed spider mine up to 3 spaces towards the nearest hostile character within Sensors. If multiple characters are equally close, you may choose which one to move towards. Spider mines treat vertical and overhanging surfaces as flat ground for the purposes of movement."
      }]
    }],
    "description": "Not really a sophisticated drone system as such, spider charges require no guidance or direction from a pilot, acting on their own once deployed. Operating with only a rudimentary target-seeking intelligence, these ambulatory high-explosive smart munitions relentlessly pursue any infantry-tier or armored targets that trigger their proximity sensors, detonating once within optimal range. C&H reminds license holders to ensure that all allied IFF codes are properly up to date and synced to local tacnets before employing this system."
  },
  {
    "id": "fgtsms_saboteur_drone",
    "name": "Saboteur Drone",
    "type": "Drone",
    "sp": 3,
    "tags": [
      {"id": "tg_unique"}
    ],
    "source" : "C&H",
    "license": "KALLARANI",
    "license_level": 3,
    "effect": "Choose a hostile mech within Sensors and make a contested check using Grit against the target's Hull. On a success, the drone latches onto their mech and begins jockeying the target, benefiting from your talents. You automatically succeed on all attempts at this check if you Scan the target at any point beforehand during the scene.",
    "deployables":[{
      "name": "Saboteur Drone",
      "type": "Drone",
      "size": 0.5,
      "hp": 5,
      "edef": 10,
      "evasion":10,
      "detail": "Once the drone begins jockeying, you automatically choose a jockeying option to perform against the target, and you may continue to choose an option for free during each of your turns while the drone remains latched to the target. This does not take an action, and may be done at any point during your turn. Hostile attacks made against a jockeying drone deal half damage, heat, or burn to the jockeyed target on a miss. The only way to remove the drone besides destroying it is to shake it off (use your Grit for all contested checks) or if the target is destroyed, after which it's recalled. You may also spend another quick action to automatically end this effect and either recall the drone or make another jockeying attempt against a hostile mech within Sensors.<br>Gain the following options for jockeying with a saboteur drone:<ul><li>Sabotage: The target makes all checks and saves with +2 Difficulty until the end of their next turn.</li><li>Rend: The target must pass a Hull save or become Shredded until the end of their next turn. On a success, they take 2 AP kinetic damage.</li><li>Breach: If the target has only 1 Structure remaining, is at 7 HP or less, and doesn't have Immunity to damage, you may order the drone to breach the cockpit and messily kill the pilot. This destroys the target instantly unless it can function without a pilot, and panic causes all hostile characters within a Burst 2 around the breached target to become Impaired until the end of their next turn. You receive a notification when a jockeyed target can be breached, and breaching the cockpit this way can only be done 1/scene.</li></ul>",
      "recall": "Quick",
      "redeploy": "Quick"
    }],
    "description": "Few drones are as reviled by pilots as the Scorpion Wasp, a specially designed seek-and subvert unit commonly employed by pirates and less reputable mercenaries due to its ability to confirm effective kills while preserving a chassis for future salvage. Nonetheless, for those willing to employ it this feared and detested drone platform provides an effective force multiplier, giving operators a variety of methods to disrupt and neutralize enemy units in the field ranging from system interference and internal damage all the way to a catastrophic cockpit breach."
  },
  {
    "id": "fgtsms_ecm_launchers",
    "name": "ECM Launchers",
    "type": "System",
    "sp": 2,
    "tags": [
      {"id": "tg_unique"},
      {"id": "tg_limited","val": 2}
    ],
    "source" : "C&H",
    "license": "MATADOR",
    "license_level": 1,
    "actions":[{
      "name":"Deploy Countermeasures",
      "activation":"Reaction",
      "frequency":"1/round",
      "trigger": "A hostile character makes a tech attack against you or an attack using a Smart weapon.",
      "detail": "Create a Burst 1 area of electronic countermeasures around you that lasts until the end of your next turn. Characters in this cloud of chaff and electrified smoke benefit from soft cover, gaining special electronic hard cover against tech attacks and Smart weapons instead. This reaction interrupts and resolves before the triggering attack."
    }],
    "description": "Even sophisticated target acquisition and electronic warfare systems can be nullified through the simple and expedient method of forcing them to wade through a morass of noise and junk data. Each of these dispensers is preloaded with an assortment of multispectrum flares, metallic chaff, electrostatic smoke, wideband IFF squawkers, and GHOST/ECHO data-strobes. A hypervigilant early warning system then blankets the surrounding area with these countermeasures as soon as hostile targeting or unauthorized system access attempts are detected."
  },
  {
    "id": "fgtsms_beartrap_counterintrusion_tracer_v23",
    "name": "BEARTRAP Counterintrusion Tracer V. 2.3",
    "type": "System",
    "sp": 2,
    "tags": [
      {"id": "tg_unique"}
    ],
    "source" : "C&H",
    "license": "MATADOR",
    "license_level": 2,
    "actions":[{
      "name": "Embed Tracer",
      "activation": "Reaction",
      "frequency":"1/round",
      "trigger": "A hostile tech action against you or an adjacent allied character succeeds, or you or an adjacent allied character fail a Systems save inflicted by a hostile character.",
      "detail": "The attacker takes 2 heat and becomes infected by a tracer program. While infected, the target cannot Hide, cannot benefit from Invisibility, and at the start of their turn they gain Lock On and you may automatically Scan them. Starting at the end of their next turn, infected characters can attempt to purge this program by passing a Systems save at the end of their turn." 
    }],
    "description": "When the SIF took up arms against Arclight forces, it became immediately apparent that what mechs and vehicles they had weren't equipped to withstand sophisticated software intrusion and e-warfare systems. Rather than fruitlessly attempt to keep enemy forces from penetrating their systems with outdated defenses they adopted a different approach, seeding hostile counterintrusion malware within their core electronics. BEARTRAP triggers upon detecting foreign intrusion, piggybacking onto the signal wave and embedding itself within the intruder's systems before activating a screamer subroutine that indiscriminately broadcasts positional and diagnostic information on all frequencies, requiring active countermeasures to purge once infected."
  },
  {
    "id": "fgtsms_punji_counterintrusion_spike_v16",
    "name": "PUNJI Counterintrusion Spike V. 1.6",
    "type": "System",
    "sp": 3,
    "tags": [
      {"id": "tg_unique"}
    ],
    "source" : "C&H",
    "license": "MATADOR",
    "license_level": 3,
    "actions": [{
      "name": "Core Spike",
      "activation": "Reaction",
      "frequency": "1/round",
      "trigger": "A hostile tech action against you or an adjacent allied character succeeds, or you or an adjacent allied character fail a Systems save inflicted by a hostile character.",
      "detail": "You may immediately become Stunned until the end of your next turn. The attacker then takes 4d6 AP energy damage from a massive feedback spike and must pass an Engineering save or become Stunned until the end of their next turn. On a success, they become Impaired and Slowed until the end of their next turn. This can only be used 1/scene on each character."
    }],
    "description": "Desperate times often call for desperate measures, and while early versions of this counterintrusion program took a definitive psychological toll against Arclight forces, the cost of its use was eventually deemed unacceptably high. By exploiting millisecond synchronizations between hostile electronics and their own core computers, SIF pilots were able to create a feedback spike capable of violently overloading an attacker's primary systems, but the strain often resulted in an uncontrolled meltdown of their own reactor as well. As a result this version, which C&H now licenses, is actually toned down from the original design, less destructive to both targets as well as users."
  },
  {
    "id": "fgtsms_crashing_avalanche_module",
    "name": "Crashing Avalanche Module",
    "type": "System",
    "sp": 1,
    "tags": [
      {"id": "tg_unique"}
    ],
    "source": "C&H",
    "license": "PESILAT",
    "license_level": 1,
    "actions":[{
      "name": "Crashing Avalanche Module",
      "activation": "Protocol",
      "detail": "You may pull a target you are grappling to any other free space adjacent to you, and until the end of your next turn that target takes 2 kinetic damage whenever they attempt a Hull check to either take control of or break free from the grapple."
    }],
    "description": "A cornerstone of many mech-based martial arts is the reflex module, customized haptic/kinesthetic control macros tied directly into a mech's core computer. These firmware packages allow pilots to execute complex and sophisticated combat maneuvers with increased speed and precision; not an expert system or partitioned intelligence, but an integrated semiautonomous reaction/response multiplier, often referred to as “muscle memory for mechs.” This particular module is an aggressive grappling suite designed to enhance close-quarters groundfighting techniques with reduced manual input requirements."
  },
  {
    "id": "fgtsms_shadowfist",
    "name": "//shadowfist",
    "type": "Tech",
    "sp": 2,
    "tags": [
      {"id": "tg_unique"}
    ],
    "source": "C&H",
    "license": "PESILAT",
    "license_level": 1,
    "effect": "Gain the following options for Invade:",
    "actions":[
      {
        "name": "Isolation Code",
        "activation": "Invade",
        "detail": "Until the end of their next turn, your target does not have line of sight to any of their own allied characters who are not adjacent to them, and they cannot benefit from their allies' systems, abilities, or tech actions."
      },
      {
        "name": "Static Void",
        "activation": "Invade",
        "detail": "Your target cannot draw line of sight to spaces further away from them than you until the end of their next turn."
      }
    ],
    "description": "A commonly employed attack-code algorithm with numerous versions and variations to befound in the employ of both electronic warfare specialists and combat art practitioners alike, this particular version is a cleaned up and optimized package tailored for use with the Pesilat. Feedback loops introduced into a target's primary sensors and fire-control systems result in a drastic reduction of sensor and targeting acuity, returning too many false positives beyond minimal operational ranges to be relied upon and often running afoul of automated safety cutouts. Weapons and e-warfare systems are unaffected directly, but suffer catastrophic performance reduction without proper guidance and clearance permissions to rely on."
  },
  {
    "id": "fgtsms_falling_star_module",
    "name": "Falling Star Module",
    "type": "System",
    "sp": 2,
    "tags": [
      {"id": "tg_unique"},
      {"id": "tg_round","val": 1}
    ],
    "source": "C&H",
    "license": "PESILAT",
    "license_level": 2,
    "actions":[{
      "name": "Falling Star Module",
      "activation": "Quick",
      "detail": "1/round, you can make a melee attack using a character you are grappling. This attack has a Threat equal to the grappled character's Size. On hit, it deals 1d6 + the grappled character's Size kinetic damage to both the target of the attack as well as the character you are grappling (bonus damage is only dealt to the target of the attack), and both characters must pass a Hull save or be knocked Prone."
    }],
    "description": "This reflex module enhances a mech's primary balance and weight distribution subroutines to allow for significantly greater leverage without compromising stability or structural integrity. In conjunction with precisely tuned power redistribution to manipulator and propulsion subsystems, pilots are able to aggressively displace opponents exceeding their mass by up to 400% for brief durations."
  },
  {
    "id": "fgtsms_serpent_fang",
    "name": "//serpent_FANG",
    "type": "Tech",
    "sp": 2,
    "tags": [
      {"id": "tg_unique"}
    ],
    "source": "C&H",
    "license": "PESILAT",
    "license_level": 2,
    "effect": "Gain the following options for Invade:",
    "actions":[
      {
        "name": "Uncertainty Trap",
        "activation": "Invade",
        "detail": "If the next action your target performs is an attack, they become Immobilized until the end of their next turn. If the next action your target performs is a standard move or Boost, they become Jammed until the end of their next turn. Performing any other action causes your target to take 2 heat and become Impaired until the end of their next turn, and they can take no further actions that turn except for their standard move. This can only be used 1/scene on each character."
      },
      {
        "name": "Liminal Cascade",
        "activation": "Invade",
        "detail": "Apply a Cascade Mark to your target. You or any allied character can consume this Mark on hit with a ranged or melee attack to teleport them 3 spaces in any direction and force them to pass a Systems save or be knocked Prone. A character can only have one Cascade Mark at a time."
      }
    ],
    "description": "An unusual dual-stage intrusion package whose precise origins are a subject of speculation, serpent_FANG injects a series of polymorphic logic bombs into the target's core processes in an uncompiled state, lying dormant until triggered by system activity. Once the target acts, the logic bombs compile into one of several configurations, bypassing active threat scans long enough to afflict them with brute-force shutdown prompts and destructive overrides. While passive countermeasures will eventually purge this hostile code given time, the opportunity it creates can be enough to give a pilot the decisive edge in a fight. Rumors persist that this software package is prone to destructive incompatibility with certain instances of HORUS-derived system architecture, but as of yet investigations into this phenomenon remain inconclusive."
  },
  {
    "id": "fgtsms_dipping_swallow_module",
    "name": "Dipping Swallow Module",
    "type": "System",
    "sp": 2,
    "tags": [
      {"id": "tg_unique"},
      {"id": "tg_heat_self","val": 2}
    ],
    "source": "C&H",
    "license": "PESILAT",
    "license_level": 3,
    "effect": "When you Brace, you may move 1 space ignoring engagement and reactions. If the triggering attacker is within range, you may also make an Improvised Attack against them as part of the Brace. If this destroys the attacker, you do not suffer the negative effects of bracing (you may continue to use reactions normally and you may move and take actions normally next turn).",
    "synergies":[{
      "locations": ["brace"],
      "detail": "When you Brace, you may move 1 space ignoring engagement and reactions. If the triggering attacker is within range, you may also make an Improvised Attack against them as part of the Brace. If this destroys the attacker, you do not suffer the negative effects of bracing (you may continue to use reactions normally and you may move and take actions normally next turn)."
    }],
    "description": "A fundamental principle of raksasa silat is the lack of distinction between attack and defense. Students are taught that even defensive measures should be undertaken with an eye towards destroying one's opponent, and this reflex module embodies that principle by overclocking a mech's reaction/response handling in conjunction with retaliatory positional modeling macros to provide practitioners and pilots with superior counteroffensive capabilities that take greater effective advantage of openings presented by aggressors."
  },
  {
    "id": "fgtsms_heartshatter_v5palm",
    "name": "//HEARTSHATTER V. 5.palm",
    "type": "Tech",
    "sp": 2,
    "tags": [
      {"id": "tg_unique"}
    ],
    "source": "C&H",
    "license": "PESILAT",
    "license_level": 3,
    "effect": "Gain the following options for Invade:",
    "actions":[
      {
        "name": "Discharge",
        "activation": "Invade",
        "detail": "Until the end of their next turn, your target becomes Impaired and each time they miss with a ranged or melee weapon attack they take 2 AP damage of that weapon's type + 1 heat."
      },
      {
        "name": "Rupture",
        "activation": "Invade",
        "detail": "Choose one of your target's weapons. That weapon is disabled and they take 4 burn. The target can spend a quick action to make an Engineering check to reactivate this weapon, or may Stabilize to automatically reactivate it. This can only be used 1/scene on each character."
      }
    ],
    "description": "A cascading asymptotic code attack specifically designed to target primary and secondary armaments, in particular ammunition loading and energy transmission subroutines, the HEARTSHATTER attack code-technique amplifies standard intrusion protocols to initiate catastrophic weapon systems failures, resulting in chain reaction ammo cook-offs and power cell discharges capable of disrupting a target's offensive systems or even destroying them outright. Appropriate caution should be exercised when engaging targets carrying highly reactive ordnance in enclosed spaces."
  },
  {
    "id": "fgtsms_slingstone_charges",
    "name": "Slingstone Charges",
    "source": "C&H",
    "license": "RETIARIUS",
    "license_level": 1 ,
    "type": "Deployable",
    "sp": 2,
    "tags" : [
        {"id": "tg_unique"},
        {"id": "tg_limited","val": 2},
        {"id": "tg_grenade"}
    ],
    "actions": [{
      "name": "Bola Grenade",
      "activation": "Quick",
        "range": [
          {
            "type": "Range",
            "val": 5
          }
        ],
        "damage": [
          {
            "type": "Explosive",
            "val": "1d6+2"
          }
        ],
      "detail": "Throw at Bola Grenade at a target within Range 5. They must pass an Agility save or fall Prone and take 1d6+2 explosive damage. On a success, they take half damage only."
    }],
    "deployables": [{
      "name": "Tripcord Mine",
      "type": "Mine",
      "range": [{
        "type": "Line",
        "val": 5
      }],
      "detail": "In additon to free adjacent spaces, this mine can also be placed on adjacent walls, pieces of cover, and terrain. When deployed this mine creates a Line 5 area oriented in any direction. It detonates when any character moves into or through this area, causing them to fall Prone. They must then pass an Agility save or take 1d6 explosive damage."
    }],
    "description": "A standardized version of a scratch-built arena staple, weighted high explosives are mounted to the ends of interconnected lengths of high-tensile nanocarbon cable, detonating once a target has become entangled. The learning curve is steeper than that of a standard combat grenade, mishaps being both more embarrassing as well as more dangerous to an inexperienced user, but with practice this unorthodox weapon can easily bring even larger opponents to their knees."
  },
  {
    "id": "fgtsms_temblor_pulse_field_generator",
    "name": "Temblor Pulse-Field Generator",
    "source": "C&H",
    "license": "RETIARIUS",
    "license_level" : 3 ,
    "type": "System",
    "sp": 3,
    "tags" : [
        {"id": "tg_heat_self", "val": 2}
    ],
    "actions": [
      {
        "name": "Generate Field",
        "activation":"Protocol",
        "detail": "This system generates a Burst 2 area that lasts until the end of your next turn. All other characters within this area treat it as difficult terrain, and characters other than you that start their turn within the area or enter the area for the first time on their turn must pass an Agility save or take 2 kinetic damage and be knocked Prone."
      },
      {
        "name": "Pulse",
        "activation":"Quick",
        "frequency": "1/round",
        "detail": "While this system is active, you may deal 20 AP kinetic damage to all objects and terrain within the area generated by the system." 
      }
    ],
    "description": "Modified from industrial mining and demolition equipment, a harmonic resonance generator utilizes audiokinetic pulses to create vibrational cascades capable of breaking down solid matter or collapsing buildings. While a full-scale version of one of these generators would be impractical to mount within a mech chassis, a scaled-down version, along with the necessary insulation to safely operate it in combat, allows a pilot to create a localized vibrational disruption field around their mech as a close area denial/suppression system."
  },
  {
    "id": "fgtsms_shield_array_drone",
    "name": "Shield Array Drone",
    "source": "C&H",
    "license": "SABREUR",
    "license_level" : 2,
    "type": "Drone",
    "sp": 2,
    "tags" : [
        {"id": "tg_unique"}
    ],
    "effect": "You deploy a Size 2 array of shield drones to any free space adjacent to you, and you may recall it by spending another quick action. Treat this array as Size 1/2 for the purpose of effects which rely on Size. This array mirrors your movements whenever you move including flight and teleportation, does not count as an obstruction and can overlap other objects and units, and you count it as hard cover. The array itself also counts as having hard cover, and has Immunity to forced movement that would cause it to break adjacency from you or remain overlapping with you.",
    "deployables":[{
      "name": "Shield Array Drone",
      "type": "Drone",
      "size": 2,
      "hp": 5,
      "edef": 10,
      "evasion": 10,
      "detail": "You gain the Drone Parry reaction.",
      "actions":[{
        "name": "Drone Parry",
        "activation": "Reaction",
        "frequency": "1/round",
        "trigger": "A hostile character makes a ranged attack against you.",
        "detail": "Take 2 heat and move the shield array to another free space adjacent to you as a reaction. This reaction interrupts and resolves before the triggering attack. You may consume Lock On if the triggering character has it instead of taking heat to use this reaction."
      }]
    }],
    "description": "Full-scale projected defense systems are often too bulky and power-intensive to be housed within drones, which is why the 'Kerubim' active defense system utilizes a distributed array of multiple projector drones operating in tandem to triangulate a protective barrier between them for precision threat interception. Rated against both solid projectile and waveform attacks, the network is capable of independently maneuvering to provide optimum, hands-free coverage against any selected target within its effective perimeter."
  },
  {
    "id": "fgtsms_evasive_vernier_array",
    "name": "Evasive Vernier Array", 
    "type": "System",
    "sp": 2,
    "tags" : [
      {"id": "tg_unique"}
    ], 
    "source": "C&H",
    "license": "SABREUR",
    "license_level" : 3 ,
    "effect": "You may immediately move 1 space in a direction of your choice whenever a ranged or melee attack misses you. This movement does not provoke reactions and ignores engagement. You may take 2 heat to increase this movement to 3 spaces.",
    "description": "Suldani mech dueling emphasizes speed and grace over brute force, with duelists frequently optimizing their machines for evasion as even a single well-placed blow can spell the difference between honorable victory and inglorious defeat. This particular optimization incorporates a full-frame array of high-powered thrusters tied to a sophisticated threat-tracking expert system. While not powerful enough to permit flight, these thrusters allow pilots to swiftly reposition their mech in response to attacks, setting up counterstrikes or simply seeking better ground from which to continue fighting from. An expanded threat database and several analytical software upgrades ensure that this system functions just as well on the battlefield as it does in the dueling circle."
  },
  {
    "id": "fgtsms_artemis_class_ai",
    "name": "ARTEMIS-Class NHP",
    "type": "AI",
    "sp": 3,
    "tags" : [
      {"id": "tg_ai"},
      {"id": "tg_unique"}
    ],
    "source": "C&H",
    "license": "SABREUR",
    "license_level" : 3 ,
    "effect": "Your mech gains the AI tag and the Artemis Protocol.",
    "actions":[{
      "name": "Artemis Protocol",
      "activation": "Protocol",
      "detail": "Choose a character within Sensors and line of sight and give them a Hunter's Mark. Characters with your Mark don't benefit from Hidden against you, and whenever you make melee attacks against a character with your Mark you may roll twice and choose either result. 1/round you may deal +1d6 bonus damage on a melee critical hit to a character with your Hunter's Mark. Any attacks you make against characters that do not have your Mark are made with +2 Difficulty and cause you to take 2 heat. While a character has your Hunter's Mark, you cannot voluntarily move away from them.<br><br>Only a single character may have your Hunter's Mark at a time, and your Mark remains active until you or the chosen target are destroyed, surrender, or retreat from the battlefield, at which point this protocol may be used again against a new target. As a full action you may move your Hunter's Mark to a different character in range."
    }],
    "description": "Combat-grade NHPs are seldom commissioned by civilian interests, and such projects are tightly restricted and closely monitored by both Union intelligence and the DoJ/HR, but with sufficient wealth and social influence all things are possible. Conceived as an NHP for duelists of influential noble houses to maintain their standings, when C&H appropriated the specifications for the Sabreur they also discovered the casket containing the prime ARTEMIS codebase, and following a six-month evaluation and assessment period made it was made available as a license to sufficiently qualified pilots. ARTEMIS clones are frequently haughty and aloof, disdainful of what they consider lesser enemies and only coming alive when confronted with a suitable foe, at which point they become almost playful. C&H recommends that care should be taken when delegating target prioritization permissions to this NHP."
  },
  {
    "id": "fgtsms_holo_charges",
    "name": "Holo Charges",
    "type": "Deployable",
    "sp": 2,
    "tags" : [
        {"id": "tg_limited","val": 2},
        {"id": "tg_unique"},
        {"id": "tg_grenade"}
    ],
    "source": "C&H",
    "license": "SAGITTARIUS",
    "license_level" : 1,
    "effect": "You may expend a charge from this system for one of the following:",
    "actions":[{
      "name": "Specter Grenade",
      "activation": "Quick",
        "range": [
          {
            "type": "Range",
            "val": 5
          }
        ],
      "detail": "Throw a Specter Grenade at a target within Range 5. Your target must pass a Systems save or they become Slowed, cannot take reactions, and do not cause engagement (though they are still affected by it themselves) until the end of their next turn. On a success, they do not cause engagement until the end of their next turn."
    }],
    "deployables": [{
      "name": "Holo Decoy",
      "type": "Mine",
      "activation": "Quick",
      "detail": "This mine detonates when any allied character moves over or adjacent to it, creating holographic duplicates of them which confuse targeting systems. The detonating character clears Lock On, and until the end of their next turn their movement ignores engagement and they count as Invisible."
    }],
    "description": "The earliest designs for this system stem from the SIF's attempts to crack and reverse-engineer a series of thermoptic decoy/camouflage systems salvaged from Arclight e-war chassis. When the security lockouts proved too intractable to bypass, the decision was made to simply repurpose the designs as limited-use field deployables instead. Once activated, each emitter is capable of projecting high-definition visual images and data signatures sufficiently robust enough to cause sensors to register them as false positives, though these images only last for a short time before the emitters are permanently disabled."
  }, 
  {
    "id": "fgtsms_inkwell_adapative_paint",
    "name": "INKWELL Adaptive Paint",
    "type": "System",
    "sp": 1,
    "tags" : [
        {"id": "tg_unique"}
    ],
    "source": "C&H",
    "license": "SAGITTARIUS",
    "license_level" : 2,
    "effect": "Ranged attacks against you receive +1 Difficulty. This effect is lost while you have any structure damage.",
    "description": "Adaptive paint is a simple but effective modification commonly adopted by scout/reconnaissance pilots as well as special operations units engaged in covert actions. Not true active camouflage, INKWELL utilizes a proprietary blend of multispectrum polymer paint, embedded optical deflection chaff, and organic-derived chromatophore analogues which mimic the surrounding area, reducing the effectiveness of optical sighting, LIDAR, and silhouette analysis at range. C&H is proud to offer an officially licensed INKWELL formulation as a part of the Sagittarius series to all qualifying pilots."      
  }, 
  {
    "id": "fgtsms_nightingale_drone",
    "name": "Nightingale Drone",
    "type": "Drone",
    "sp": 2,
    "tags" : [
      {"id": "tg_unique"},
      {"id": "tg_limited", "val": 3}
    ],
    "source": "C&H",
    "license": "SAGITTARIUS",
    "license_level" : 2,
    "effect": "Expend a charge to launch a nightingale drone to a free space within Sensors and line of sight where it immediately becomes Hidden.",
    "deployables":[{
      "name": "Nightingale Drone",
      "type": "Drone",
      "size": 0.5,
      "hp": 5,
      "edef": 10,
      "evasion": 10,
      "detail" : "If a hostile character takes the Search action to find a Hidden character while a nightingale drone is within their Sensors, they must first pass a Systems save or their Search attempt automatically fails, they gain Lock On, and they become Impaired until the end of their next turn; this save does not cause you to lose Hidden. Once a character fails this save, the drone burns out and is destroyed, otherwise it lasts until the end of the scene. You may move a deployed nightingale drone to a new location within Sensors as a quick action.",
      "redeploy": "Quick"
    }],
    "description": "Nightingale drones are a basic enough design; a low profile, self-guided platform equipped with a cloned copy of a pilot's IFF transponder and a series of wideband emitters capable of emulating a chassis' power and sensor signatures. Once deployed they remain in a minimal power standby state until they detect active sensor sweeps, springing to life and transmitting false returns. The model favoried by the Cheshire Cats employs embedded viral counterintrusion software derived from the Matador as an additional force multiplier."
  },
  {
    "id": "fgtsms_tactical_translocator",
    "name": "Tactical Translocator",
    "type": "Deployable",
    "sp": 2,
    "tags" : [
      {"id": "tg_limited", "val": 2},
      {"id": "tg_unique"}
    ],
    "source": "C&H",
    "license": "SAGITTARIUS",
    "license_level" : 3 ,
    "effect": "You may spend a charge from this system to plant a teleportation beacon on a free space within Range 3 and line of sight.",
    "deployables": [{
      "name": "Tactical Translocator",
      "type": "Beacon",
      "detail": "As a free action, you may teleport to any of your deployed beacons. Once used, a beacon burns out and becomes inoperative, otherwise it lasts until the end of the scene.<br><br>If you teleport to a beacon while another character is occupying the space you instead teleport to a free space of your choice adjacent to that character, and if that character is hostile they must pass an Agility save or take 1d6 AP energy damage, be knocked Prone, and become Shredded until the end of their next turn. On a success, they take half damage only."
    }],
    "description": "As their conflict with the SIF has dragged on and incurred greater losses than initially anticipated, Arclight TransColonial has authorized the deployment of increasingly advanced technologies in an attempt to authoritatively secure their claim upon Suldan, which has resulted in an aggressive cycle of adaptation and improvisation as the SIF responds by claiming Arclight technology for their own use. The so-called tactical translocator is the most recent such development, derived from an as-yet undesignated infiltration and assassination chassis pattern which has been sighted in recent skirmishes. Created through trial and error, the value of tactical point-to-point non-realspace movement has proven to be an invaluable, if occasionally dangerous, addition to the SIF's arsenal."
  },
  {
    "id": "fgtsms_echo_cloak",
    "name": "Echo Cloak",
    "type": "System",
    "sp": 3,
    "tags" : [
        {"id": "tg_unique"},
        {"id": "tg_heat_self", "val": 2}
    ],
    "source": "C&H",
    "license": "SAGITTARIUS",
    "license_level" : 3 ,
    "effect": "While you are Hidden you may activate this system, choosing a hostile character within Sensors and line of sight equal to your Size or larger and shrouding yourself in holographic camouflage that duplicates that character's appearance; your mech's actual Size remains unchanged.",
    "actions":[{
      "name": "Activate Echo Cloak",
      "activation": "Protocol",
      "detail": "You immediately teleport your speed and are no longer Hidden, but you may now move through (but not stop your movement in) spaces occupied by hostile characters, and your movement ignores engagement and reactions. Before attempting to take any hostile actions against you, characters with line of sight to a character whose appearance you duplicated must make a Systems save. On a failure, they don't lose the action, but cannot target you and believe the copied character to be you until the end of their next turn.<br><br>If a character who fails this save chooses to make an attack against the copied character (prioritizing weapons and non-Invade tech attacks) and succeeds, this effect immediately ends. The effect also ends if you are hit by an attack or fail a save from a hostile source, if the mimicked target is destroyed, or if you make an attack or force any saves beyond the save forced by this system. You may only mimic one target at a time, and mimicking a new target replaces the last disguise with the new one.<br><br>While mimicking a character, the next attack you make gains +1 Accuracy and deals +1d6 bonus damage on hit (or +2 heat for tech attacks)."
    }],
    "description": "The latest breakthrough in the Cheshire Cats' ongoing exploration of reverse-engineered Arclight decoy/camouflage technology, the echo cloak is a resource-intensive system thus far reserved only for select chassis, most notably those tasked with high risk operations behind enemy lines. A network of visual projectors and sensor baffles are tied directly into core threat recognition systems, taking incoming visual and multispectral signature data and generating a realtime volumetric facsimile overlay across the equipped chassis. Internal Arclight combat metrics during actions against SIF strike teams utilizing echo cloaks display a significant rise in blue-on-blue incidents as a result, and new ROE protocols and IFF encryption measures are being hurriedly pushed in response."
  },
  {
    "id": "fgtsms_spatial_threader",
    "name": "Spatial Threader",
    "type": "System",
    "sp": 2,
    "tags": [
      {"id": "tg_unique"}
    ],
    "source": "HORUS",
    "license": "EFREET",
    "license_level": 1,
    "effect": "Whenever you Bolster an allied character, you may choose one of the following additional effects. Only one such additional effect can be chosen each time you Bolster:",
    "actions": [{
      "name": "Synchronicity",
      "activation": "Quick Tech",
      "detail": "Until the end of the current turn, that character mirrors your non-teleportation movements exactly. This involuntary movement ignores engagement and does not provoke reactions, but it does not ignore obstructions. If the character would be unable to move due to being obstructed, it remains in place and resumes mirroring your movement once capable of doing so."
    },
    {
      "name": "Disjunction",
      "activation": "Quick Tech",
      "detail": "That character ignores engagement and does not treat hostile characters as obstructions. This effect is lost if they make any attack rolls or force any saves."
    }],
  "synergies":[{
    "locations": ["tech"],
    "detail": "Whenever you take the Bolster tech action, you may choose one of the following additional effects. Only one such additional effect can be chosen each time you Bolster."
  }],
    "description": "Horus pattern-groups have historically made use of esoteric space-warping principles in several other extant chassis designs, but the precise nature of these designs and their operation remains a mystery as-yet unsolved by Union technicians, resulting in black box systems which can be utilized and even studied indirectly but not reverse-engineered. This particular system, known only as a \"spatial threader,\" is capable of projecting localized/entangled metafolds across independent units within proximal distance via bijective carrier wave, creating bubbles of \"folded space\" which can be modulated by a sufficiently practiced operator."
  },
  {
    "id": "fgtsms_entanglement_leash",
    "name": "Entanglement Leash",
    "type": "Tech",
    "sp": 2,
    "tags": [
      {"id": "tg_unique"}
    ],
    "source": "HORUS",
    "license": "EFREET",
    "license_level": 2,
    "effect": "Gain the following options for Invade:",
    "actions": [
      {
        "name": "Interpolate",
        "activation":"Invade",
        "detail": "Apply an Entanglement Mark to your target. During your turn you may make melee attacks against targets with your Entanglement Mark in line of sight as though they are within range regardless of their physical location. Entanglement Marks last until the end of the scene or until the target is destroyed. Only one target may have your Entanglement Mark at a time, and applying your Mark to a different target removes it from the first."
      },
      {
        "name": "Mobius Anchor",
        "activation":"Invade",
        "detail": "Your target is Immobilized until they succeed on a Systems save at the end of their turn. This effect also immediately ends if you make an attack, force any saves beyond the save forced by this system, or if your mech moves (even involuntarily) without teleporting."
      }
    ],
    "description": "Aggressive mil-spec applications of quantum entanglement have generally been relegated to the field of electronic/information warfare given the difficulties inherent in maintaining quantum state coherence in macroscopic combat contexts. Through ingenious exploitation of blinkspace shunts in its q-circuits, the \"entanglement leash\" is able to resist nonlocal decoherence through a form of quantum interrogation, allowing pilots to directly engage enemy units regardless of apparent physical proximity."
  },
  {
    "id": "fgtsms_metafold_shunt",
    "name": "Metafold Shunt",
    "type": "System",
    "sp": 2,
    "tags": [
      {"id": "tg_unique"},
      {"id":"tg_heat_self","val": 2}
    ],
    "source": "HORUS",
    "license": "EFREET",
    "license_level": 2,
    "effect": "When you Brace, you may immediately teleport to a free space adjacent to the triggering attacker. That target must then pass a Systems save or be knocked Prone.",
    "synergies":[{
      "locations":["brace"],
      "detail": "When you Brace, you may immediately teleport to a free space adjacent to the triggering attacker. That target must then pass a Systems save or be knocked Prone."
    }],
    "description": "++Feel the circuit connect, a momentary unification created from the intent to do harm made manifest. Reach out and feel the path unfolding before you in the instant of contact as two existences briefly become one. Get ready, take a deep breath, and [jump]"
  },
  {
    "id": "fgtsms_ibeji_class_nhp",
    "name": "IBEJI-Class NHP",
    "type": "AI",
    "sp": 3,
    "tags": [
      {"id": "tg_ai"},
      {"id": "tg_unique"},
      {"id":"tg_heat_self","val": 3}
    ],
    "source": "HORUS",
    "license": "EFREET",
    "license_level": 3,
    "effect": "Your mech gains the AI tag and IBEJI Instantiation:",
    "actions": [{
      "name": "IBEJI Instantiation",
      "activation": "Quick",
      "detail": "You create a spatial echo of your mech in a free space within Range 5. This echo counts as yourself for the purpose of effects and abilities, but is otherwise considered a separate character. The echo shares all of your stats, systems, weapons, traits, and abilities, but it has only 5 HP, no Heat Cap, and cannot meltdown, Self-Destruct, or trigger any effects from being destroyed. Conditions and statuses are not shared between you and the echo except for those caused by your own systems, talents, etc, but other ongoing effects are.<br>You may take any actions you wish through this echo, except for IBEJI Instantiation, dividing your standard movement and actions between yourself and the echo in any combination you see fit. When you take an action, you can measure Range and line of sight from the echo or yourself. However any expended uses of Limited systems, any systems with restrictions on their use (per round, per scene, per character, etc), any fired Loading weapons apply to both your mech and the echo simultaneously, and all self-inflicted heat as well as all heat clearing is applied to your mech even if used through the echo.<br>Only one echo may exist at a time, and using this ability while an echo already exists replaces it with a new one. The echo also disappears if you end your turn more than 5 spaces away from it as well as at the end of the scene."
    }],
    "description": "When the code for an unknown NHP was discovered among the files recovered from the Taiko-Fujikoshi Sistema main data stores it was immediately quarantined under emergency protocol NOVEMBER ECHELON as it was suspected that it may have been responsible for the incident, though after extensive questioning and psychological evaluation this was determined not to be the case. IBEJI is an unstable NHP with a mercurial personality, prone to spinning off numerous mayfly partitions in order to hold multipartite conversations with themselves and others. IBEJI's primary purpose is surgical non-destructive extraction of classical communication channels from elaborate quantum circuits at an efficiency rate well beyond the upper bounds of Iyer-Yao convolutional calculus. Attempting to decompile the algorithms involved for further analysis has thus far proven impossible (see USB reports 89 through 105)."
  },
  {
    "id": "fgtsms_sabr_engines",
    "name": "SABR Engines",
    "type": "Flight System",
    "sp": 2,
    "tags": [
      {"id": "tg_unique"},
      {"id": "tg_limited","val": 1}
    ],
    "source": "SSC",
    "license": "COMET",
    "license_level": 1,
    "actions":[{
      "name": "Activate High-Powered Booster",
      "activation": "Protocol",
      "detail": "You may immediately fly 10 spaces but you become Jammed until the start of your next turn. This movement ignores engagement and doesn't provoke reactions, but you must end this movement on the ground or another surface you can stand on or immediately fall."
    }],
    "description": "SSC's Scramjet-Assisted Booster Rig system is designed to facilitate VSTOL and surface-to-orbit transfers for subline ships, heavy cargo transports, and personnel shuttles, providing sufficient thrust to achieve mach 1.1 before separation. While most chassis designs are unsuited for supersonic cruise speeds without substantial reinforcement, SSC nonetheless offers a frame-compatible jump jet analogue version that allows for dramatic acceleration and short-duration flight capabilities across both terrestrial and naval theaters."
  },
  {
    "id": "fgtsms_whitestar_signal_interceptor",
    "name": "Whitestar Signal Interceptor",
    "type": "Tech",
    "sp": 2,
    "tags": [
      {"id": "tg_unique"}
    ],
    "source": "SSC",
    "license": "COMET",
    "license_level": 2,
    "effect": "Gain the following options for Invade:",
    "actions":[
      {
        "name": "Retransmission Protocols",
        "activation": "Invade",
        "detail": "Your target is marked as a retransmission point. Until the end of your next turn, you and all allied characters within Range 10 of your target may use them as a point of origin for ranged attacks against other characters with Launchers, Nexus, and Smart weapons, checking Range, cover, and line of sight from the marked character's position. You do not need line of sight to a marked character to use this effect."
      },
      {
        "name": "Tacnet Echo",
        "activation": "Invade",
        "detail": "Your target gains Lock On, becomes Impaired until the end of their next turn, and all hostile characters in a Burst 2 area around the target must pass a Systems save or gain Lock On."
      }
    ],
    "description": "Adapted from SSC's EYESHINE strategic theater command and control architecture, the Whitestar signal interceptor uses an aggressive multi-vector systemic intrusion package to enable pilots to hijack and assimilate enemy targeting telemetry data in order to enhance their own tactical networks."
  },
  {
    "id": "fgtsms_ewecm_array",
    "name": "EW/ECM Array",
    "type": "System",
    "sp": 2,
    "tags": [
      {"id": "tg_unique"}
    ],
    "source": "SSC",
    "license": "COMET",
    "license_level": 3,
    "actions": [{
      "name": "Warning Tone",
      "activation": "Reaction",
      "frequency": "1/round",
      "trigger": "A hostile character with Lock On within Sensors makes an attack against you or an allied character.",
      "detail": "Consume the triggering character's Lock On and add +2 Difficulty to their attack roll. This reaction interrupts and resolves before the triggering attack. If the attack misses, the attack's target may move 1 space, ignoring engagement and reactions."
    }],
    "description": "A threat warning system and countermeasure control unit originally designed for use on tactical strike fighters, SSC's \"Bellwether\" Early Warning/Electronic Countermeasures package is used to provide total area defensive coverage against incoming threats. Tuned to detect and defeat radar, lidar/laser guidance, active electromagnetic sensors, and weapon targeting intelligences with a full suite of fast-response jamming protocols, the array is capable of coordinating operations with both squadron-wide tactical networks and onboard comp/con or NHP assets as needed."
  },
  {
    "id": "fgtsms_turret_mount",
    "name": "Turret Mount",
    "type": "System",
    "sp": 1,
    "tags": [
      {"id": "tg_unique"}
    ],
    "source": "IPS-N",
    "license": "WORDEN",
    "license_level": 1,
    "effect": "Your mech has a mounted weapon emplacement which can be operated by a single Size 1/2 non-mech character. A character can Mount or Dismount this emplacement as a quick action. Mounted characters occupy the same space as you, move when you move, and gain soft cover. On their turn, they may attack using the following pilot weapon as a full action. [Mounted HMG: Reliable 2, Range 10, 2d3 Kinetic.]",
    "description": "Even before the advent of mechanized combat chassis, pintle-mounted turrets have long been a common addition to armored vehicles throughout the history of warfare as a cheap, robust, and effective force multiplier. While riding desant upon chassis is a practice generally cautioned against by Union military regulations due to safety concerns, units in the field are known to frequently disregard these regulations, and IPS-N offers them a standardized fabrication license for a modular gun mounting cross-compatible with multiple frame configurations."
  },
  {
    "id": "fgtsms_mass_pack",
    "name": "MASS Pack",
    "type": "System",
    "sp": 3,
    "tags": [
      {"id": "tg_unique"},
      {"id": "tg_round", "val": 1}
    ],
    "source": "IPS-N",
    "license": "WORDEN",
    "license_level": 2,
    "actions":[{
      "name": "MASS PACK",
      "activation": "Quick",
      "detail": "1/round you may use this system to swap one of your equipped Cannon or Launcher weapons to any one of the following special ammunition types. This effect persists until the end of the scene, until you spend a quick action to swap that weapon to a different ammunition type, or you revert a weapon to its normal state as a protocol. Only one special ammunition type can be used on a weapon at a time."
    }],
    "ammo": [
      {
        "name": "Marker Rounds",
        "detail": "The weapon deals half damage, heat, and burn, but on a hit targets gain Lock On.",
        "allowed_types":["cannon","launcher"]
      },
      {
        "name": "Concussion Rounds",
        "detail": "The weapon does half damage, heat, and burn, but gains Knockback 2.",
        "allowed_types":["cannon","launcher"]
      },
      {
        "name": "Flak Rounds",
        "detail": "The weapon gains Overkill, and any flying target hit by this weapon must pass a Hull save or immediately land (this counts as falling without any damage); additionally, they can't fly until the end of their next turn.",
        "allowed_types":["cannon","launcher"]
      }
    ],
    "description": "The Multi-Ammunition Smart Selection pack system is an IPS-N initiative to streamline field logistics for units engaged in protracted fire support operations. Originally conceived as a dorsal-mounted chassis-portable microprinter assembly for enabling in-field resupply during extended reconnaissance, in practice it proved too cumbersome for long range patrols but found new life as a dedicated specialized ammunition loading system for heavy weapons platforms. Capable of quickly rotating through a variety of specialty ammunition types on demand with minimal ROF interruption, the system comes preloaded with a selection of fully licensed templates compatible with a wide variety of standard IPS-N armaments at no extra cost."
  },
  {
    "id": "fgtsms_counterfire_suite",
    "name": "Counterfire Suite",
    "type": "System",
    "sp": 2,
    "tags": [
        {"id": "tg_unique"}
    ],
    "license": "WORDEN",
    "license_level": 3,
    "source": "IPS-N",
    "actions":[{
      "name": "Sustained Counterfire",
      "activation": "Reaction",
      "frequency": "1/round",
      "trigger": "A hostile character hits an allied character within Sensors with an attack.",
      "detail": "Spend your Overwatch to cause the attacker to gain Lock On. Until the end of your next turn, your next ranged attack against that character deals +1d6 bonus damage on a critical hit."
    }],
    "description": "A cornerstone of IPS-N fire support doctrine is the concept of aggressive sustained counterfire, neutralizing threats as they occur through immediate, overwhelming ballistic response. The BLOODHOUND intelligent fire assistance system incorporates a suite of counterballistic sensors along with a dedicated target-tracker comp/con unit to monitor all local threat envelopes and provide pilots with optimized retributive firing solutions."
  },
  {
    "id": "fgtsms_bridgelayer",
    "name": "Bridgelayer",
    "type": "Deployable",
    "sp": 1,
    "tags": [
      {"id": "tg_unique"}
    ],
    "source": "HA",
    "license": "AGRIPPA",
    "license_level": 1,
    "deployables":[{
      "name": "Deployable Bridge",
      "type": "Deployable",
      "evasion": 5,
      "hp": 20,
      "detail": "You unfold and lay a deployable bridge upon the ground in a free 3x6 space adjacent to you. This bridge is flat, doesn't obstruct movement, and has evasion 5 and 20 HP. It can be placed over difficult or dangerous terrain allowing units up to Size 3 to walk across it as though it was regular terrain, if placed over mines it prevents them from triggering when characters move into spaces that would normally trigger them, and it can be placed across chasms, pits, and cliffs so long as both ends of it can be placed on solid ground. Picking this system up again is a full action.",
      "recall":"Full"
    }],
    "description": "The Armory's vehicle-deployed bridge system is suitable for both tracked vehicles and combat chassis, serving as a lightweight and robust tool for crossing obstacles and unsafe terrain quickly and efficiently. Constructed of high-strength nanocarbon memory polymer with an origami-engineered interior lattice, the bridge unit collapses into a surprisingly compact package which, when fully deployed, is capable of supporting over 60 tons of weight without structural compromise."
  },
  {
    "id": "fgtsms_shock_pylons",
    "name": "Shock Pylons",
    "type": "Deployable",
    "sp": 2,
    "tags": [
      {"id": "tg_unique"},
      {"id": "tg_limited", "val": 2}
    ],
    "source": "HA",
    "license": "AGRIPPA",
    "license_level": 2,
    "deployables":[{
      "name": "Charged Pylon",
      "type": "Deployable",
      "size": 1,
      "evasion": 5,
      "hp": 10,
      "detail": "You deploy a shock pylon in a free adjacent space, which activates and projects an electrical barrier. Treat this barrier as a Line 4 area 4 spaces high originating from the pylon in a direction of your choice that provides soft cover, but doesn't count as an obstruction or block line of sight. Any character that starts their turn in the area or enters it for the first time in a round must pass an Engineering save or take 1d6 energy damage and become Impaired and Slowed until the end of their next turn. On a success, they take half damage only.<br>As a quick action, you may reorient the pylon's barrier in a new direction or deactivate it. Otherwise it lasts until the end of the scene.",
      "deactivation":"Quick"
    }],
    "description": "The earliest versions of the field-deployed electromagnetic barricade were designed for colonial use as a perimeter defense tool for deterring hostile xenofauna from encroaching upon fledgling settlements. Explorations of potential military applications followed soon thereafter, and while the necessary increased power output drastically shortens the unit's uptime, it nonetheless functions as an effective area-denial and temporary fortification system."
  },
  {
    "id": "fgtsms_heavy_lift_gear",
    "name": "Heavy Lift Gear",
    "type": "System",
    "sp": 2,
    "tags": [
      {"id": "tg_unique"}
    ],
    "source": "HA",
    "license": "AGRIPPA",
    "license_level": 2,
    "actions":[{
      "name": "Deploy Stabilizers and Extend Crane",
      "activation": "Protocol",
      "detail": "You may deploy stabilizers and extend your attached crane, becoming Immobilized while this system is active. While active, your lifting capacity is tripled, and you may use a quick action to either choose any Prone allied character within Range 5 and stand them up, or to choose any allied character within Range 5 equal to your own Size or smaller and move them 5 spaces both horizontally and vertically in any direction. This movement ignores engagement and reactions and that character must end this movement on the ground or another solid surface, or else immediately begin falling. You may deactivate this system as a protocol.",
      "deactivation": "Protocol"
    }],
    "description": "The Hercules mobile crane is a mil-spec variant of a civil engineering model, ruggedized to withstand the wear and tear of battlefield conditions. Most commonly employed during salvage-and-repair actions, skilled operators are able to effectively apply the crane's substantial lifting capacity during combat in unconventional ways."
  },
  
  {
    "id": "fgtsms_system_optimizer",
    "name": "System Optimizer",
    "type": "Tech",
    "sp": 3,
    "tags": [
      {"id": "tg_unique"}
    ],
    "source": "HA",
    "license": "AGRIPPA",
    "license_level": 3,
    "effect": "Whenever you Bolster an allied character, you may choose one of the following additional effects. Only one such additional effect can be chosen each time you Bolster:",
	    "actions": [{
        "name": "Emergency Venting Protocols",
        "activation": "Quick Tech",
        "detail": "That character cools 2 heat and may clear Exposed. A character can only benefit from this effect 1/scene."
      },
      {
        "name": "Enhanced Diagnostic Sequence",
        "activation": "Quick Tech",
        "detail": "That character gains 2 Overshield and may clear either Impaired or Slowed as long as these conditions weren't caused by their own systems or abilities."
      }],
    "synergies":[{
      "locations": ["tech"],
      "detail": "Whenever you take the Bolster tech action, you may choose one of the following additional effects. Only one such additional effect can be chosen each time you Bolster."
    }],
    "description": "Armory combat engineering doctrine places equal emphasis on electronic systems integrity and countermeasures as it does physical repairs and reconstruction. AMT Legionnaire combat operations typically involve a designated support unit which maintains administrative oversight of all squad-linked tactical and diagnostic networks. A regularly updated and refined suite of inoculative and restorative measures are available to enhance squad performance metrics and mitigate damage inflicted by systemic intrusion."
  },
  {
    "id": "fgtsms_parvati_class_nhp",
    "name": "PARVATI-Class NHP",
    "type": "AI",
    "sp": 3,
    "tags": [
      {"id": "tg_ai"},
      {"id": "tg_unique"},
      {"id": "tg_heat_self", "val": 5},
      {"id": "tg_limited", "val": 1}
    ],
    "license": "AGRIPPA",
    "license_level": 3,
    "source": "HA",
    "effect": "Your mech gains the AI tag and Shining City.",
    "actions":[{
      "name": "Shining City",
      "activation": "Full",
      "frequency": "1/scene",
      "tags": [
        {"id": "tg_heat_self", "val": 5},
        {"id": "tg_limited", "val": 1}
      ],
      "detail": "1/scene, you can create a series of hardlight constructs within Sensors in any free spaces oriented however you like. Once placed these constructs last until the end of the scene and then dissipate. All hardlight constructs have Immunity to all damage and can be moved through physically, but any character that moves into them for the first time in a round or starts their turn overlapping their space takes 2 burn.<br><br>Create the following structures:<ul><li>A wall, up to 6 spaces long and 4 spaces high. Characters cannot draw line of sight across the wall if they are not at least partially on the same side of the wall as their target and attacks or other effects cannot cross it if they did not originate on the same side, even those that ignore line of sight.</li><li>Two Size 2 areas which count as difficult terrain. These may not be placed adjacent to each other.</li><li>One Size 2 hardlight microlance emitter. 1/round as a free action you may choose a single target within Range 5 and line of sight of the emitter. That target must pass an Agility save or take 3 burn and be knocked back 2 spaces. On a success, they take 1 burn only.</li></ul>"
    }],
    "description": "Beyond the most basic offensive and defensive applications, a substantial portion of the Think Tank's research into applied hardlight theory have been focused on the ultimate goal of utilizing the technology for utilitarian purposes as well as military ones, the so-called instant city paradigm which envisions buildings and even more complex feats of engineering crafted entirely from stable, tangible energy. However, maintaining multiple independent hardlight objects, particularly more advanced geometric structures, requires more processing power than conventional comp/con systems are capable of providing, and as yet none of the attempts to reduce projected hardlight's temperatures to safe levels have proven fruitful.<br><br>While the solution to the thermal issues still remains elusive, the Think Tank's interim solution to the stability problem was the curation of a dedicated NHP designed to oversee and maintain novel hardlight structures in real-time. PARVATI-Class NHPs are unique in that they require a corresponding hardware upgrade in order to make full use of their capabilities. A series of experimental hardlight emitters embedded within a designated chassis' structure are utilized to both shape and sustain emitted constructs under PARVATI's supervision. PARVATI clones as a personality tend to be task-oriented, precise, and orderly, though personable and protective of those under their care, and they appear to be somewhat more resistant to cascade stressors than other similar NHP models, a quality Armory engineers are keen to study further."
  },
  {
    "id": "fgtsms_atg_precision_bombs",
    "name": "ATG Precision Bombs",
    "type": "Deployable",
    "sp": 3,
    "tags": [
      {"id": "tg_limited","val": 2},
      {"id": "tg_unique"}
    ],
    "source": "SSC",
    "license": "SPARROWHAWK",
    "license_level": 1,
    "actions":[{
      "name": "Arm Bomb",
      "activation": "Quick",
      "detail": "Arm a bomb for deployment. While flying, as part of a move or Boost you can drop an armed bomb onto a space that you pass over or adjacent to at any point during that movement. All characters within a Blast 1 or Line 8 area must pass an Agility save or take 1d6+3 explosive damage and be knocked Prone. On a success, they take half damage only. This system deals 20 AP explosive damage to objects, cover, terrain, and the environment. You may have only one bomb armed at a time, and armed bombs disarm at the end of the scene."
    }],
    "description": "Adapting the concept of precision-guided air-to-ground munition packages from aerospace fighter/bombers to a chassis-based paradigm, the KILLDEER tactical strike munition system employs a multi-mode seeker and internal guidance stabilization to deliver high-powered surgical airstrikes with minimal circular error probability. Detonation profiles are pilot-selectable, and each warhead is effective against armored units and infantry-tier opposition alike as well as capable of penetrating even hardened ground targets."
  },
  {
    "id": "fgtsms_suzukaze_thermoregulation",
    "name": "SUZUKAZE Thermoregulation",
    "type": "System",
    "sp": 3,
    "tags": [
      {"id": "tg_unique"}
    ],
    "source": "SSC",
    "license": "MYRMIDON",
    "license_level": 1,
    "effect": "At the end of your turn, clear 1 heat.",
    "description": "While coldcore reactors run substantially hotter than any purely biological system could feasibly attempt to regulate, SSC has invested considerable resources into researching the viability of hybrid biotechnological thermoregulation systems compatible with full-scale combat chassis. Thus far, their most promising development has been a unique system augmenting conventional heat sinks with a pseudovascular fluid network suffused with an engineered KAZE-strain microbial culture. KAZE thrives in high-temperature environments and emits an evaporative coolant compound as a byproduct of their heat-accelerated metabolic processes, which is then shunted through hull-embedded microvents. Initial results have been positive and SSC's next step is to eliminate the allergenic side-effects reported among a percentage of licensed pilots during field trials."
  },
  {
    "id": "fgtsms_hsc_exoplating",
    "name": "HSC Exoplating",
    "type": "Shield",
    "sp": 3,  
    "tags": [
      {"id": "tg_unique"},
      {"id": "tg_overshield"}
    ],
    "source": "SSC",
    "license": "MYRMIDON",
    "license_level": 1,
    "effect": "When you Stabilize, you may additionally spend 1 repair to gain Grit + 4 Overshield.",
    "synergies":[{
      "locations": ["stabilize"],
      "detail": "When you Stabilize, you may additionally spend 1 repair to gain Grit + 4 Overshield."
    }],
    "description": "A continuation of developmental research into biologically-sourced composite materials engineering initially pioneered by SSC's proprietary Kai Bioplating, this structural enhancement consists of a layered composite which meshes traditional reinforced armor laminate with an integrated carbonate bioweave matrix derived from arthropoidal megafauna genebanks. When activated with a catalytic protein compound, macro-scale hypersclerotization rapidly occurs throughout the matrix layer, temporarily enhancing structural durability and impact resistance even against advanced military grade weaponry until eventual protein dissolution."
  },
  {
    "id": "fgtsms_sentry_drone",
    "name": "Sentry Drone",
    "type": "Drone",
    "sp": 3,
    "tags" : [
      {"id": "tg_unique"}
  ],
    "source": "IPS-N",
    "license": "VIGIL",
    "license_level": 1,
    "effect": "You can deploy this drone in a free adjacent space. Take any one non-Superheavy CQB, Cannon, or Rifle you have equipped, remove it from your mech, and mount it to the drone when you deploy it. The drone takes its own independent turn during which it may only attack with the weapon mounted to it using your Grit, Save Target, and core bonuses, but it doesn't benefit from or trigger your talents. Loading weapons mounted to this drone are reloaded whenever you Stabilize.<br><br>The drone can be picked back up and the weapon returned to your mech as a full action. If the drone is destroyed make an Engineering check. On a success the weapon remains intact and may be reequipped, otherwise the weapon is destroyed as well.",
    "deployables": [{
      "name": "Sentry Drone",
      "type": "Drone",
      "activation": "Full",
      "size": 0.5,
      "hp": 10,
      "edef": 10,
      "evasion": 10,
      "detail" : "The drone gains the Sentry Mode reaction.",
      "actions":[{
        "name": "Sentry Mode",
        "activation": "Reaction",
        "frequency": "1/round",
        "trigger": "A hostile character moves within Range 3 of the sentry drone.",
        "detail": "It makes an attack against that character at +2 Difficulty."
      }],
      "recall": "Full"
    }],
    "description": "The latest iteration of IPS-N's remote area security emplacement system, the sentry drone collapses to become mech portable but can be quickly deployed even when under enemy fire. The universal fast-mounting adapter fits most currently manufactured mainline weapon systems, giving operators tactical flexibility in multiple engagement scenarios and the integrated GUARDIAN comp/con is capable of independent threat tracking and target interdiction in addition to pilot-in-the-loop and ultimatum/deterrence protocol as defensive scenarios dictate."
  },
  {
    "id": "fgtsms_active_defense_system",
    "name": "Active Defense System",
    "type": "Deployable",
    "sp": 2,
    "tags": [
      {"id": "tg_limited", "val": 2},
      {"id": "tg_shield"},
      {"id": "tg_unique"}
    ],
    "source": "IPS-N",
    "license": "VIGIL",
    "license_level": 1,
    "effect": "As a quick action you can deploy this system in a free adjacent space.",
    "deployables": [{
      "name": "Active Defense System",
      "type": "Deployable",
      "size": 1,
      "hp": 10,
      "evasion": 5,
      "detail" : "You can deploy this system in a free, adjacent space, where it emits a Burst 2 interception field. Ranged attacks made against you, the system, or any allied characters within the field take +1 Difficulty, and attacks made with Thrown, Arcing, or Seeking weapons also treat targets within the field as Invisible. This effect lasts until the end of the scene, or until the system is destroyed."
    }],
    "description": "Developed as a compact version of an active threat defense screen commonly employed as a fixed emplacement system, IPS-N's deployable ADS utilizes a comprehensive scanner array to continually monitor local space for incoming ballistic threats. Once locked on, a network of independently tracking gimbal-mounted turrets engage low-velocity projectiles entering the kill envelope with a combination of antisensor pulse laser jamming and hard-target interception via counterballistic airburst launchers."
  },
  {
    "id": "fgtsms_fcs_tacnet_relay",
    "name": "FCS Tacnet Relay",
    "type": "System",
    "sp": 3,
    "tags": [
      {"id": "tg_unique"},
      {"id": "tg_round", "val": 1}
    ],
    "license": "OVERLORD",
    "license_level": 1,
    "source": "IPS-N",
    "effect": "1/round, choose one:<ul><li>When you consume Lock On, you may choose one allied character within Sensors and they gain +1 Accuracy on the next attack roll they make until the end of their next turn.</li><li>When an allied character within Sensors consumes Lock On, you may gain +1 Accuracy on the next attack roll you make until the end of your next turn.</li></ul>",
    "description": "While many conventional military units commonly employ dedicated squadron-tier tactical networks to disseminate sensor and targeting data on the individual level, IPS-N's SPYGLASS tactical network node provides squad leaders, forward reconnaissance units, and electronic systems operation specialists with a dedicated expert system designed to collate input from multiple targeting feeds simultaneously and deliver enhanced, predictive-modeled firing solutions. All IPS-N fireteams incorporating SPYGLASS tactical architecture report significant improvements in combat performance metrics compared to those without, and mandatory integration is expected to occur over the next several decades."
  },
  {
    "id": "fgtsms_mithra_class_ai",
    "name": "MITHRA-Class NHP",
    "type":  "AI",
    "sp": 3,
    "tags": [
      {"id": "tg_ai"},
      {"id": "tg_unique"},
      {"id": "tg_heat_self", "val": 1}
    ],
    "source": "IPS-N",
    "license": "OVERLORD",
    "license_level": 1,
    "effect": "Your mech gains the AI tag and the MITHRA Protocol.",
    "actions": [{
      "name": "MITHRA Protocol",
      "activation": "Protocol",
      "detail": "You grant one of the following effects to an allied character in Sensors, or you may increase the cost of this protocol to 3 heat to grant them two of the following effects at once:<ul><li>That character's next ranged or melee attack that consumes Lock On gains Reliable based on weapon size (Auxiliary: 1, Main: 2, Heavy or larger: 3), or if it already has Reliable it adds +1 to its value.</li><li>That character's next ranged or melee attack that consumes Lock On gains AP.</li><li>That character can attack a character with the Lock On condition as if their weapon had Arcing, but must consume the Lock On during the attack.</li></ul>These effects end when used or at the end of the scene.",
      "tags" : [
        {"id": "tg_heat_self", "val": 1}
      ]
    }],
    "description": "Following the release of the SEKHMET-class NHP platform, pilot feedback indicated a strong desire for a more subordinate, support-oriented NHP designed to facilitate squadlevel operations as opposed to personal combat engagements. After several false starts, the decision was made to base development upon the extant SPYGLASS framework, cultivating a full-fledged NHP from its tactical heuristcs. MITHRA-Class NHPs are detached and dispassionate with a strong emphasis on chain-of-command and hierarchical structure, often assuming direct authority over paired SPYGLASS systems within local tactical networks."
  },
  {
    "id": "fgtsms_tatzelwurm",
    "name": "Tatzelwurm",
    "type": "Tech",
    "sp": 1,
    "tags": [
      {"id": "tg_unique"}
    ],
    "source": "HORUS",
    "license": "LOGOS",
    "license_level": 1,
    "effect": "Gain the following Quick Tech option:",
    "actions":[{
      "name": "Botnet",
      "activation": "Quick Tech",
      "detail": "Choose a character within Range 3. You may then target a different character within Range 3 of the first target, and repeat this process as long as there are new, valid targets within range. Each target must then pass a Systems save or take 1 heat. The next tech attack you make gains +1 Accuracy, and it deals +1 heat on hit for every failed save, up to a maximum of +3 heat. This effect does not stack, and characters can't be targeted more than once with the same use of this system."
    }],
    "description": "Union Omninet Bureau forensic analysts place the earliest identifiable widespread occurrence of the \"Tatzelwurm\" malware strain roughly 300 Cradle standard years ago. Built upon a common paradigm of self-propagating invasive code, Tatzelwurm is unique in its unprecedented rate of mutative evolutionary recoding, rendering conventional firewalls obsolete within a startlingly brief period of time. As a result, the UOB maintains a department dedicated to the study and preventative inoculation of each emerging strain and encourages pilots operating in high signal traffic theaters to regularly update all electronic defense systems in order to avoid infection." 
  },
  {
    "id": "fgtsms_aversion_reflex",
    "name": "AVERSION/REFLEX",
    "type": "Tech",
    "sp": 2,
    "tags": [{
        "id": "tg_unique"
      }
    ],
    "source": "HORUS",
    "license": "LOGOS",
    "license_level": 1,
    "effect": "Gain the following options for Invade:",
    "actions": [
      {
        "name": "Pariah Strain",
        "activation": "Invade",
        "detail": "Until the end of your target's next turn, all other hostile characters within Burst 2 of them receive +1 Difficulty on all attacks. This effect does not stack with itself."
      },
      {
        "name": ">//YOUMISS./_ALLTHEFUN",
        "activation": "Invade",
        "detail": "Your target treats all Accuracy as Difficulty until the end of its next turn."
      }
    ],
    "description": "The AVERSION/REFLEX viral attack code is designed to exploit weaknesses in local tactical networks, embedding itself within a target system before using it as a transmission node for falsified and corrupted joint targeting telemetry feeds. By piggybacking upon IFF-authenticated data channels, AVERSION/REFLEX bypasses related electronic defences to cause significant degradation in combat performance metrics on the squad level until purged by the carrier."
  },
  {
    "id": "fgtsms_scanner_charges",
    "name": "Scanner Charges",
    "type": "Deployable",
    "sp": 2, 
    "tags": [
      {"id": "tg_limited", "val": 2},
      {"id": "tg_unique"},
      {"id": "tg_grenade"}
    ],
    "source": "HORUS",
    "license": "THIRDEYE",
    "license_level": 1,
    "actions":[{
      "name" : "Pulse Grenade",
      "activation": "Quick",
        "range": [
          {
            "type": "Range",
            "val": 5
          },
          {
            "type": "Blast",
            "val": 2
          }
        ],
      "detail": "Throw a Pulse Grenade within Range 5. Scan all hostile characters within the affected area, and hostile characters within the area cease to be Hidden, cannot Hide, and cannot benefit from Invisibility as long as they remain there. This area lasts until the end of your next turn." 
    }],
    "deployables": [{
      "name": "Echo Mine",
      "type": "Mine",
      "range": [{
        "type": "Burst",
        "val": 3
      }],
      "detail" : "This mine detonates when any character moves over or adjacent to it. You and all allied characters ignore line of sight when making ranged attacks and tech actions against characters within the area, and gain +1 Accuracy on all attacks against characters within it. Hostile characters within the area cease to be Hidden, cannot Hide, and cannot benefit from Invisibility as long as they remain there. This area lasts until the end of your next turn; if you take the Scan or Lock On Quick Tech action during your next turn, you may extend the duration of all your detonated echo mine areas for an additional round. This effect can be repeated."
    }],
    "description": "Remotely deployed sensors are a concept that hearkens back to the earliest days of drone warfare. A bundle of high-frequency active scanners packaged together in a quick-release canister gives pilots the ability to rapidly deploy them over obstructions or around corners, obtaining real-time updates on enemy positions and movement and coordinating firing solutions across integrated tactical networks."
  },
  {
    "id": "fgtsms_ontological_metatactical_pulse",
    "name": "Ontological Metatactical Pulse",
    "type": "System",
    "sp": 4,
    "tags": [
      {"id": "tg_limited", "val": 1},
      {"id": "tg_unique"}
    ],
    "source": "HORUS",
    "license_level": 1,
    "license": "BUNRAKU",
    "actions":[{
      "name": "Ontological Metatactical Pulse",
      "activation": "Quick",
      "frequency": "1/scene",
      "detail": "1/scene you may activate this system, becoming Stunned until the end of your next turn. All allied characters within Sensors may then immediately perform any or all of the following as a reaction: <br>-Move 3 spaces ignoring engagement and reaction attacks <i>or</i> instantly stand from prone <br> then <br>-Reload a Loading weapon <i>or</i> gain +1 Accuracy to their next attack <br> and finally <br>-End any one condition on themselves <i>or</i> set their heat to half their Heat Cap, placing them in the Danger Zone.<br>Hostile characters within Sensors must pass a Systems save or become Impaired and Slowed until the end of their next turn."
    }],
    "description": "[how can a simple thing like this contain such multitudes, you ask?<br>do not listen to those who tell you the universe is vast.<br>the universe lies within me. It lies within you (for you are also me.)<br>distance and division are falsehoods told to the self by the deceiver known as space/time.<br>so prick your fingers upon the mountaintops and swim within the electron orbit's current.<br>embrace existence in a handful of dust]"
  },
  {
    "id": "fgtsms_ego_bridge",
    "name": "Ego Bridge",
    "type": "Tech",
    "sp": 3,
    "tags": [
      {"id": "tg_heat_self", "val": 2},
      {"id": "tg_unique"}
    ],
    "source": "HORUS",
    "license": "BUNRAKU",
    "license_level": 1,
    "effect": "Gain the following Quick Tech option:",
    "actions":[{
      "name": "Interlocution",
      "activation":"Quick Tech",
      "frequency":"1/round",
      "detail": "An allied character within Sensors and line of sight may take 2 heat to immediately Skirmish using a weapon of your choice as a reaction. All attacks are made at +1 Difficulty and use that allied character's own stats as well as both their talents and your own talents if applicable (identical shared talents do not stack with each other)."
    }],
    "description": "An unusual battlefield support system believed to be derived from higher-level MINOTAUR subroutines, an ego/impulse transmission bridge establishes a peer-to-peer network connection between the user and an allied pilot via sub-NHP fire-control systems, momentarily overlaying second-tier reflex channels with first-tier cognitive directives. Frequent use of this system has been known to result in involuntary ego sublimation, dissociative disorders, and in rare cases existential catatonia, and regular pilot psychological debriefings are highly recommended."
  },
  {
    "id": "fgtsms_agrav_vane",
    "name": "Agrav Vane",
    "type": "Flight System",
    "sp": 2,
    "tags": [
      {"id": "tg_unique"}
    ],
    "source": "HA",
    "license": "DOWNWELL",
    "license_level": 1,
    "actions":[{
      "name": "Agrav Vane",
      "activation": "Protocol",
      "detail": "When you activate this system you cannot make tech actions, attacks, or any actions that force saves, but you may hover when you move and are immune to all fall damage. You also gain the benefits of soft cover as long as this system is active. This effect lasts for the rest of the scene, or until deactivated as a protocol."
    }],
    "description": "An outgrowth of the gravity pulse/wave technology first employed in the Armory's Iskander license, the so-called \"agrav vane\" is an attempt at realizing the long theorized dream of continuous-operation antigravity flight. This current model is the most robust iteration of the concept, capable of uninterrupted uptime for longer than any other such generator to date, but the Casimir envelope's turbulent interference with weaponry and electronic systems remains an as-yet unresolved issue, limiting the system's tactical applications. Hardware burnout rates are another such issue, and users are encouraged to replace vanes on a per-deployment basis to minimize occurrences of midair catastrophic failure."
  },
  {
    "id": "fgtsms_weapon_pod",
    "name": "Weapon Pod",
    "sp": 2,
    "tags": [
      {"id": "tg_unique"}
    ],
    "source": "C&H",
    "license": "SHEPHERD",
    "license_level": 1,
    "effect": "When you equip this system, it can house two Auxiliary weapons or up to one Main weapon and one Auxiliary weapon which you choose and store within the pod. Weapons stored in this way are not equipped to your mech's mounts and may not be used to attack, nor can they be reloaded. As a quick action you may swap the weapons stored in the pod with those equipped to one of your non-integrated mounts. All final weapon mountings, pod storage, and SP costs must be legal. If this system is destroyed, all weapons stored on it are disabled and inaccessible until the weapon pod is repaired.",
    "description": "Each of Chandrasekhar & Herschel's custom weapon pods is designed-to-order at the time of licensing, or users can select from hundreds of predesigned options to find the one that best suits their needs. Mounted to an articulated, gyro-stabilized armature and insulated from shock, fire, and ballistic impacts, the pod retracts to minimize effects on range-of-motion when not in use, but quickly repositions to allow for fast and effective in-field armament selection on demand."
  }              
]